{
  "backend/main.mo": "Defines Motoko actor types and comparison utilities for events, competitions, payments, and results, including sorting helpers and data models for the platform.",
  "feature_evidence.json": "Lists feature evidence records describing implemented admin-query wiring and admin error-state improvements with associated files and metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files describing their roles in routing, UI, admin pages, solve flow, and profile logic.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables for light/dark modes and applying global base styles.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx.",
  "frontend/public/env.json": "Provides environment variable containing backend canister ID.",
  "frontend/public/razorpay.config.json": "Stores Razorpay payment configuration including key, currency, and theme settings.",
  "frontend/REGRESSION_SMOKE_TEST_CHECKLIST.md": "Manual regression checklist covering authentication, competitions, payment flow, solve flow, timers, and refresh recovery scenarios.",
  "frontend/src/api/errors.ts": "Maps various backend error messages to user-friendly strings.",
  "frontend/src/api/queryKeys.ts": "Defines stable React Query keys and key generators for API caching.",
  "frontend/src/App.tsx": "Configures React Query, theme provider, and full TanStack Router route tree for public and admin pages.",
  "frontend/src/components/admin/CompetitionPricingFields.tsx": "UI component for selecting and editing competition fee modes and syncing changes upward.",
  "frontend/src/components/auth/AdminGuard.tsx": "Protects admin pages by checking authentication and admin status, showing loaders or errors as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and clearing cached queries on logout.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that blocks access until the user is authenticated, showing a login prompt otherwise.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Card UI for a competition showing name, dates, status, and event info with navigation.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout with header, navigation, auth controls, and responsive mobile menu.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Renders a leaderboard table showing ranks, competitor names, Ao5, and solve times, with navigation to user profiles.",
  "frontend/src/components/profile/PaymentsPurchasesSection.tsx": "Displays a user's payment history with sorting, loading states, and detailed payment cards.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Shows a dropdown menu for authenticated users with profile info and logout handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Provides a dialog for creating a user profile by collecting email and display name and submitting them.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Implements a 15‑second inspection countdown with scramble visibility toggling and start/skip controls.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Displays a completion screen after all solves with navigation options and video evidence submission instructions.",
  "frontend/src/components/solve/SolveTimer.tsx": "Interactive solve timer component that starts, updates, and stops a millisecond timer, notifying parent callbacks on start and completion.",
  "frontend/src/components/system/ActorInitializationError.tsx": "Displays a detailed connection error message with troubleshooting steps and a retry button.",
  "frontend/src/components/system/AdminQueryErrorPanel.tsx": "Shows a compact admin data‑loading error panel with the error message and a retry action.",
  "frontend/src/config/razorpay.ts": "Loads Razorpay config from a JSON file with caching and falls back to default values on failure.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a before‑unload browser prompt when enabled to warn users about unsaved progress.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current caller’s user profile once an actor is available.",
  "frontend/src/hooks/useGoLiveAttempt.ts": "Manages multi‑step go‑live deployment simulation, tracking step status, diagnostics, and errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state tracking.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser back navigation with a confirmation prompt when enabled.",
  "frontend/src/hooks/useQueries.ts": "Contains query and mutation helpers for backend interactions including users, competitions, payments, and results.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables and base styling.",
  "frontend/src/lib/ao5.ts": "Provides Ao5 calculation logic handling DNFs and defines leaderboard entry types.",
  "frontend/src/lib/competitionPricing.ts": "Utility functions to detect paid competitions and format or extract pricing information.",
  "frontend/src/lib/csv.ts": "Generates and downloads CSV files for competition results with escaping utilities.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into readable date and date-time strings.",
  "frontend/src/lib/goLiveDiagnostics.ts": "Simulates deployment steps with callbacks, random failures, and error normalization.",
  "frontend/src/lib/goLivePreflight.ts": "Runs preflight checks for environment, payment config, network, and build artifacts.",
  "frontend/src/lib/razorpay.ts": "Loads Razorpay checkout script and opens payment checkout using configured options.",
  "frontend/src/lib/solveSession.ts": "Stores, retrieves, and clears solve-session data in sessionStorage.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times into readable seconds or DNF.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/admin/AdminCompetitionsPage.tsx": "Displays and manages all competitions with actions for creating, deleting, locking, and activating using admin queries.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Form page for creating a new competition, handling event selection, scramble input, fee configuration, and validation before submission.",
  "frontend/src/pages/admin/AdminEditCompetitionPage.tsx": "Loads an existing competition for editing, populates fields, validates scrambles, and submits updates via admin API.",
  "frontend/src/pages/admin/AdminGoLivePage.tsx": "Runs deployment preflight checks and shows step-by-step go-live progress with diagnostics and failure handling.",
  "frontend/src/pages/admin/AdminLandingPage.tsx": "Provides the admin dashboard landing page with navigation to user, competition, and results management sections.",
  "frontend/src/pages/admin/AdminResultsPage.tsx": "Admin UI for selecting competitions/events, viewing results, toggling visibility, and exporting filtered results to CSV.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin interface to list users and perform block, unblock, and delete actions with loading/error handling.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Displays competition details, handles event selection, payment flow, and starting or resuming a competition session.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Fetches and lists competitions grouped by status with cards for running, upcoming, and completed events.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows a competition leaderboard with event selection and handles loading and error states.",
  "frontend/src/pages/LeaderboardsHubPage.tsx": "Lists all competitions with status badges and links to their leaderboards, requiring authentication.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the authenticated user's profile and includes a payments history section.",
  "frontend/src/pages/PublicProfilePage.tsx": "Shows a public competitor profile with basic stats and event-based results grouping.",
  "frontend/src/pages/SolveFlowPage.tsx": "Manages the solve flow with inspection, solve timing, session sync, and recovery handling using backend queries and local session storage.",
  "frontend/src/types/admin.ts": "Local admin-side type definitions for result inputs, profiles, and user summaries.",
  "frontend/src/types/backend-extended.ts": "Extended type definitions mirroring backend Motoko models including competitions, results, leaderboards, and session state.",
  "frontend/src/types/domain.ts": "Defines event labels, the event list, and a default event constant.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session storage values.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Metadata describing project state, architecture, issues, and features for the speedcubing platform."
}