{
  "backend/main.mo": "Motoko backend defining competition, results, payments, authorization, and state management with custom sorting utilities.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme variables and base styling.",
  "frontend/index.html": "HTML entry root mounting the React app via main.tsx.",
  "frontend/src/api/errors.ts": "Utility to normalize backend error messages into user-facing text.",
  "frontend/src/api/queryKeys.ts": "Centralized React Query cache key definitions including per-event keys.",
  "frontend/src/App.tsx": "Main React app setting up routing, query client, dark theme, and profile setup gating.",
  "frontend/src/components/auth/AdminGuard.tsx": "Component restricting access to allowlisted admins with loading and denial states.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with handling for stale sessions.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard showing login prompt when unauthenticated.",
  "frontend/src/components/competition/CompetitionCard.tsx": "UI card showing competition metadata, status, and navigation link.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with header, navigation, footer, and a special simplified layout for solve flow routes.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Renders a leaderboard table with ranks, Ao5 computation, attempt details, and user display names.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Shows the user's profile info and supports inline editing and saving of the display name.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A modal dialog for first‑time users to set email and display name, creating their profile.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Implements the inspection countdown logic with penalties and reveals scramble during the inspection phase.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Displays a completion message after all solves and provides navigation to leaderboard or competition page.",
  "frontend/src/components/solve/SolveTimer.tsx": "A solve timer that starts/stops timing solves and reports the elapsed time on completion.",
  "frontend/src/config/razorpay.ts": "Contains Razorpay test-mode configuration settings for payments.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a beforeunload handler to warn users before leaving the page when enabled.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the currently authenticated user's profile using the actor, gated on actor readiness.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for Internet Identity login, logout, and identity management.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser back navigation with a confirmation prompt when enabled.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for admin checks, user profiles, competitions, results, and mutations using the backend actor.",
  "frontend/src/index.css": "Tailwind setup defining global CSS variables, themes, and base styles.",
  "frontend/src/lib/ao5.ts": "Calculates average of five (Ao5) times with DNF rules and defines leaderboard entry types.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into human‑readable dates.",
  "frontend/src/lib/razorpay.ts": "Loads the Razorpay script and opens the payment checkout with configured options.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times into seconds.milliseconds or DNF.",
  "frontend/src/main.tsx": "Initializes React root with query client and Internet Identity provider.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Provides an admin form to create a competition with events, scrambles, fees, and metadata, then submits via API.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Displays competition details, handles event selection, payment flow, and starting a competition.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Fetches competitions, groups them by status, and displays them using CompetitionCard components with loading and empty states.",
  "frontend/src/pages/LeaderboardPage.tsx": "Loads a competition and its leaderboard for a specific event and displays results or a no-results message.",
  "frontend/src/pages/SolveFlowPage.tsx": "Manages the user solve flow including inspection, solving, submission, and attempt progression for a competition event.",
  "frontend/src/types/domain.ts": "Defines event labels, the list of all events, and the default event constant.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters for navigation state handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, containers, and loading plugins.",
  "project_state.json": "Defines the project’s current architecture, features, issues, and requirements for an online speedcubing platform, including tech stack, admin rules, multi‑event support, and known competition‑creation error."
}