{
  "backend/main.mo": "Defines core competition, profile, payment, and result types along with comparison utilities for ordering events and user-event tuples.",
  "feature_evidence.json": "Lists feature evidence linking inspection-time penalty fix to specific frontend files and components with high-confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, pages, and hooks across the app.",
  "frontend/index.css": "Sets Tailwind base layers and theme variables for light and dark modes, defining shared UI colors and borders.",
  "frontend/index.html": "Minimal HTML wrapper that loads the React app via main.tsx.",
  "frontend/public/env.json": "Contains backend canister ID configuration for the frontend.",
  "frontend/public/razorpay.config.json": "Stores Razorpay payment configuration including keyId, currency, and UI theme.",
  "frontend/REGRESSION_SMOKE_TEST_CHECKLIST.md": "Manual QA checklist covering authentication, admin access, competition creation, leaderboards, and user-management regression tests.",
  "frontend/src/api/errors.ts": "Normalizes backend and network errors into user-friendly messages for competitions, sessions, payments, and authorization.",
  "frontend/src/api/queryKeys.ts": "Defines reusable React Query cache keys for competitions, profiles, admin data, and solve sessions.",
  "frontend/src/App.tsx": "Initializes React Router, route tree, query client, and wraps the app with theme and query providers.",
  "frontend/src/components/admin/CompetitionPricingFields.tsx": "UI component for selecting and editing different competition fee structures and emitting FeeMode updates.",
  "frontend/src/components/auth/AdminGuard.tsx": "Protects admin-only pages by checking authentication and admin status, showing loading or denial screens as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that handles Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content requiring authentication and displays a login prompt when the user is not signed in.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Displays a competition summary card with status, dates, event count, and navigation to the competition page.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with header, navigation, auth controls, and mobile menu handling.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Renders a leaderboard table computing Ao5 from results and linking competitors to their public profiles.",
  "frontend/src/components/profile/PaymentsPurchasesSection.tsx": "Displays user payment history with loading, error, and empty states, sorting payments by date.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Provides a dropdown menu showing user profile info and navigation options with logout handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog for creating a user profile by submitting email and display name.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Implements a 15‑second inspection countdown with optional scramble reveal before solving.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Shows a completion screen after all solves with navigation options and video submission instructions.",
  "frontend/src/components/solve/SolveTimer.tsx": "Runs a solve timer with start/stop controls and reports the measured time to the parent.",
  "frontend/src/components/system/ActorInitializationError.tsx": "Displays an error message for failed backend initialization with retry guidance.",
  "frontend/src/config/razorpay.ts": "Loads Razorpay payment configuration from a JSON file with cached fallback defaults.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a beforeunload handler to warn users before leaving the page when enabled.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user's profile using the active backend actor, syncing loading state with actor availability.",
  "frontend/src/hooks/useGoLiveAttempt.ts": "Manages multi‑step deployment simulation state, including progress updates, diagnostics, and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser back navigation with a confirmation prompt when enabled.",
  "frontend/src/hooks/useQueries.ts": "Defines numerous data‑fetching and mutation hooks using the backend actor, plus helpers for mapping backend types.",
  "frontend/src/index.css": "Sets Tailwind layers and custom CSS variables for theming in light and dark modes.",
  "frontend/src/lib/ao5.ts": "Computes average‑of‑5 solve times with DNF handling and defines leaderboard entry types.",
  "frontend/src/lib/competitionPricing.ts": "Determines whether competitions are paid and formats fee information for display.",
  "frontend/src/lib/csv.ts": "Generates and downloads CSV files, including specialized export for competition results.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into human‑readable date and datetime strings.",
  "frontend/src/lib/goLiveDiagnostics.ts": "Simulates a multi‑step deployment process with random failures and provides utilities for generating and normalizing deployment error messages.",
  "frontend/src/lib/goLivePreflight.ts": "Runs preflight checks for environment files, payment config, network access, and build artifacts, returning all detected failures.",
  "frontend/src/lib/razorpay.ts": "Loads the Razorpay checkout script and opens the payment widget using config and order details, returning the payment result.",
  "frontend/src/lib/solveSession.ts": "Manages tab‑scoped solve session tokens in sessionStorage, including storing, retrieving, checking, and clearing sessions.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times into a seconds.milliseconds string or returns DNF for invalid values.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminCompetitionsPage.tsx": "Lists all competitions for admins with actions to create, edit, delete, lock/unlock, and activate/deactivate them.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Provides a form for admins to create a new competition, including events, scrambles, dates, limits, and fee configuration.",
  "frontend/src/pages/admin/AdminEditCompetitionPage.tsx": "Loads an existing competition for editing and lets admins modify details, events, scrambles, status, and fees.",
  "frontend/src/pages/admin/AdminGoLivePage.tsx": "Runs and displays deployment preflight checks and step‑by‑step progress for going live to production.",
  "frontend/src/pages/admin/AdminLandingPage.tsx": "Shows the admin dashboard with navigation to management sections and quick actions like creating competitions or deploying.",
  "frontend/src/pages/admin/AdminResultsPage.tsx": "Allows admins to filter, view, export, and toggle visibility of competition results by competition and event.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin page that lists all users and provides actions to block, delete, reset competition status, and view solve history via various admin API mutations.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Displays competition details, handles event selection, payment flow, and starting or resuming competition sessions.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Fetches competitions and renders running, upcoming, and completed lists with loading and empty states.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a competition leaderboard with event selection, ranking icons, AO5 calculation, and navigation to competitor profiles.",
  "frontend/src/pages/LeaderboardsHubPage.tsx": "Lists all competitions with status indicators and links to their leaderboards, requiring authentication.",
  "frontend/src/pages/ProfilePage.tsx": "Provides an authenticated user's profile editor with display name, country, gender fields, and a payments tab.",
  "frontend/src/pages/PublicProfilePage.tsx": "Shows a public competitor profile with basic info and aggregated event results stats.",
  "frontend/src/pages/SolveFlowPage.tsx": "Manages the full solve flow including inspection, timing, penalties, scramble fetching, and result submission.",
  "frontend/src/types/admin.ts": "Defines admin-specific TypeScript types for result inputs, public profile info, and user summaries.",
  "frontend/src/types/backend-extended.ts": "Extends backend-generated types with additional competition, result, leaderboard, and session-related interfaces not included in the generated API.",
  "frontend/src/types/domain.ts": "Defines event labels, a complete event list, and the default event used throughout the app.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Project metadata describing the platform’s features, architecture, known issues, and development state."
}