{
  "backend/main.mo": "Defines event comparison logic and many public types for competitions, payments, results, and user profiles.",
  "feature_evidence.json": "Lists feature evidence records mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend React files and components.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and global styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/public/env.json": "Stores the backend canister ID for the frontend environment.",
  "frontend/public/razorpay.config.json": "Razorpay configuration including key ID, currency, branding, and theme.",
  "frontend/REGRESSION_SMOKE_TEST_CHECKLIST.md": "Markdown checklist outlining post-deployment regression smoke tests for admin, competitions, leaderboards, and users.",
  "frontend/src/api/errors.ts": "Maps various backend error messages to user-friendly strings, falling back to generic messages when needed.",
  "frontend/src/api/queryKeys.ts": "Defines stable React Query cache keys and key factories for competitions, profiles, results, and admin data.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and global providers for the React app, including admin and public pages.",
  "frontend/src/components/admin/CompetitionPricingFields.tsx": "UI component for selecting and editing different competition pricing modes and emitting the corresponding FeeMode value.",
  "frontend/src/components/auth/AdminGuard.tsx": "Protects admin-only routes by checking authentication and admin status, showing loaders or access denied when appropriate.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow with loading and error recovery behavior.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content and prompts users to log in if unauthenticated, showing a loading state during initialization.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Displays a clickable competition card with name, dates, status, event count, and participant limit, navigating to details on click.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout with header, navigation, auth controls, and responsive mobile menu, integrating admin visibility and routing.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Renders a leaderboard table showing ranks, competitors, Ao5 scores, and individual solve times with profile navigation.",
  "frontend/src/components/profile/PaymentsPurchasesSection.tsx": "Displays the user's payment history with loading, error, empty states, and sortable payment cards.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Provides a dropdown menu for authenticated users showing profile info, navigation, and logout handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog for creating a user profile by submitting email and display name with validation and async mutations.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Manages a 15-second inspection timer with penalty and DNF handling, showing scramble and phase transitions.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Shows a completion screen after all solves with navigation options and instructions for submitting video evidence.",
  "frontend/src/components/solve/SolveTimer.tsx": "Interactive solve timer component that tracks time, displays running state, and triggers onComplete when stopped.",
  "frontend/src/components/system/ActorInitializationError.tsx": "UI error component showing initialization failures with retry and troubleshooting steps.",
  "frontend/src/config/razorpay.ts": "Loads Razorpay payment config from a JSON file with caching and default fallback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Warns users before leaving the page when enabled by attaching a beforeunload handler.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user's profile using the backend actor with loading and status handling.",
  "frontend/src/hooks/useGoLiveAttempt.ts": "Manages multi‑step deployment simulation with preflight checks, step updates, errors, and diagnostic logs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout logic, and persistent identity management via AuthClient.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser back navigation when enabled by confirming before allowing route changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for competitions, results, payments, and other backend interactions.",
  "frontend/src/index.css": "Tailwind base setup defining light/dark theme CSS variables and applying global background, text, and border styles.",
  "frontend/src/lib/ao5.ts": "Defines leaderboard types and computes average-of-5 times with DNF handling and penalty logic.",
  "frontend/src/lib/competitionPricing.ts": "Provides helpers to detect paid competitions and format pricing details from various fee modes.",
  "frontend/src/lib/csv.ts": "Exports competition results to a downloadable CSV file, formatting attempts and escaping fields.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into human-readable dates.",
  "frontend/src/lib/goLiveDiagnostics.ts": "Simulates deployment steps with status callbacks, random failures, and error normalization utilities.",
  "frontend/src/lib/goLivePreflight.ts": "Runs preflight checks for env files, payment config, network connectivity, and build artifacts.",
  "frontend/src/lib/razorpay.ts": "Loads the Razorpay script and opens a configured checkout modal using provided order details.",
  "frontend/src/lib/solveSession.ts": "Manages tab-scoped solve session tokens using sessionStorage for store, retrieve, and clear operations.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times into seconds or returns DNF for invalid times.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider, importing global styles.",
  "frontend/src/pages/admin/AdminCompetitionsPage.tsx": "Displays all competitions for admins with options to create, edit, lock/unlock, and delete. Handles related mutations and loading states.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Provides a form for admins to create competitions with event selection, scramble input, and fee configuration. Validates inputs before submitting the creation request.",
  "frontend/src/pages/admin/AdminEditCompetitionPage.tsx": "Allows admins to edit an existing competition, preloading its data including scrambles, events, and fees. Supports updating all fields with validation.",
  "frontend/src/pages/admin/AdminGoLivePage.tsx": "Runs and displays deployment steps for going live, including preflight checks, progress indicators, and diagnostics download/copy options.",
  "frontend/src/pages/admin/AdminLandingPage.tsx": "Shows the admin dashboard with navigation to user, competition, and results management, plus quick actions for creating competitions and deployment.",
  "frontend/src/pages/admin/AdminResultsPage.tsx": "Admin page for selecting competitions/events, viewing results, toggling visibility, recalculating leaderboards, and exporting results to CSV.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin interface for listing users and performing actions like block, unblock, delete, reset competition status, and view solve history.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Displays competition details, handles event selection, payment via Razorpay, and starting a solve session.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Fetches and lists competitions grouped by status with cards for running, upcoming, and completed events.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows leaderboard for a selected competition event, computing ranks and Ao5 from fetched results.",
  "frontend/src/pages/LeaderboardsHubPage.tsx": "Lists all competitions with status badges and links to their leaderboards; requires authentication.",
  "frontend/src/pages/ProfilePage.tsx": "Allows authenticated users to view and edit their profile and access payment history.",
  "frontend/src/pages/PublicProfilePage.tsx": "Displays a public competitor profile with stats and grouped event results.",
  "frontend/src/pages/SolveFlowPage.tsx": "Manages the timed solve flow for a competition attempt, handling inspection, solving, submission, and session recovery. Uses queries and session state to progress through attempts and block navigation until completion.",
  "frontend/src/types/admin.ts": "Defines admin-side types for result input, public profile info, and user summaries including blocked status and profile fields.",
  "frontend/src/types/backend-extended.ts": "Extends backend-generated types for competitions, results, leaderboards, profiles, and session state, matching Motoko definitions.",
  "frontend/src/types/domain.ts": "Provides event labels, a list of all supported events, and the default event used throughout the app.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, retrieving, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Project metadata describing platform features, architecture notes, known issues, and existing feature statuses."
}