{
  "backend/main.mo": "Defines core backend types for competitions, results, payments, and comparison utilities, including event ordering and public-facing structures.",
  "backend/migration.mo": "Implements migration from old competition data to a new format by adding registrationStartDate while preserving existing fields.",
  "feature_evidence.json": "Lists feature evidence entries linking features to frontend file changes, components used, and related test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend components, pages, and hooks used across the application.",
  "frontend/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes using CSS layers.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx and hosts the root div.",
  "frontend/public/env.json": "Stores environment configuration including backend canister ID.",
  "frontend/public/razorpay.config.json": "Contains Razorpay payment widget configuration such as keyId, currency, and theme.",
  "frontend/REGRESSION_SMOKE_TEST_CHECKLIST.md": "Provides a manual regression checklist covering authentication, admin access, competitions, leaderboards, and user management.",
  "frontend/src/api/errors.ts": "Maps various backend error messages to user‑friendly strings with fallback handling for unknown errors.",
  "frontend/src/api/queryKeys.ts": "Defines stable React Query cache keys and key generator functions for competitions, profiles, results, admin data, and solve sessions.",
  "frontend/src/App.tsx": "Sets up the React app’s routing tree, query client, and theme provider, defining all public and admin routes.",
  "frontend/src/components/admin/CompetitionPricingFields.tsx": "UI component for selecting and configuring competition pricing modes, syncing fee mode changes to the parent.",
  "frontend/src/components/auth/AdminGuard.tsx": "Protects admin‑only routes by checking identity and admin status, showing loaders or an access‑denied message when needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity, handling authentication state, errors, and query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content and shows a login prompt or loading state when the user is not authenticated.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Clickable card displaying key competition info such as status, dates, events, and participant limit, navigating to its details.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout providing header navigation, admin access links, authentication controls, and a responsive mobile menu.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Renders a leaderboard table showing ranks, competitor names, Ao5, and solve times with navigation to profiles.",
  "frontend/src/components/profile/PaymentsPurchasesSection.tsx": "Displays the user's payment history with sorting, loading states, and detailed payment cards.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Provides a user dropdown menu with profile info, navigation, and logout handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Shows a modal for new users to enter email and display name and submit profile creation.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Implements the WCA-style 15-second inspection timer with penalty and DNF handling.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Displays a completion screen after all solves with navigation options and video evidence instructions.",
  "frontend/src/components/solve/SolveTimer.tsx": "Interactive solve timer component that tracks elapsed time and triggers onComplete when stopped.",
  "frontend/src/components/system/ActorInitializationError.tsx": "Displays a connection error message with guidance and a retry button.",
  "frontend/src/config/razorpay.ts": "Loads and caches Razorpay config from a JSON file with a fallback default.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a beforeunload listener to warn users when leaving with unsaved progress.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user's profile using the active backend actor.",
  "frontend/src/hooks/useGoLiveAttempt.ts": "Manages simulated deployment steps, tracking statuses, errors, and diagnostic logs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading, login, and identity management.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser navigation when enabled, prompting the user to confirm leaving.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching competitions, results, and related data via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables and base styling.",
  "frontend/src/lib/ao5.ts": "Defines leaderboard types and computes average of 5 attempts with DNF handling.",
  "frontend/src/lib/competitionPricing.ts": "Provides helpers to detect paid competitions and format/display pricing from fee modes.",
  "frontend/src/lib/csv.ts": "Exports competition results to CSV, escapes values, and includes generic CSV generation/download utilities.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into human‑readable date and date-time strings.",
  "frontend/src/lib/goLiveDiagnostics.ts": "Simulates deployment steps with callbacks, random failures, and error normalization utilities.",
  "frontend/src/lib/goLivePreflight.ts": "Runs preflight checks for config files, Razorpay setup, connectivity, and build artifacts.",
  "frontend/src/lib/razorpay.ts": "Loads Razorpay script and opens the checkout UI using configured payment options.",
  "frontend/src/lib/solveSession.ts": "Manages tab-scoped solve session tokens using sessionStorage.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times into readable strings with DNF handling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity provider.",
  "frontend/src/pages/admin/AdminCompetitionsPage.tsx": "Displays all competitions for admins with actions to delete, lock/unlock, and activate/deactivate items.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Provides a form for admins to create a new competition, configure events, scrambles, dates, and fee modes.",
  "frontend/src/pages/admin/AdminEditCompetitionPage.tsx": "Allows admins to edit an existing competition’s details, events, scrambles, dates, and fees.",
  "frontend/src/pages/admin/AdminGoLivePage.tsx": "Runs deployment-related preflight checks and step-by-step go‑live operations with diagnostics and progress tracking.",
  "frontend/src/pages/admin/AdminLandingPage.tsx": "Admin dashboard linking to management sections and quick actions like creating competitions or initiating deployment.",
  "frontend/src/pages/admin/AdminResultsPage.tsx": "Admin interface for filtering competition results, toggling visibility, and exporting them to CSV.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin dashboard for listing users and performing actions like block, delete, reset competition status, and viewing solve history.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Shows competition details, handles event selection, payment flow, and starting a solve session.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Lists competitions grouped by status with loading state and competition cards.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays event leaderboards for a competition, including ranks, times, and navigation.",
  "frontend/src/pages/LeaderboardsHubPage.tsx": "Shows all competitions with quick access to their leaderboards, requiring authentication.",
  "frontend/src/pages/ProfilePage.tsx": "Allows authenticated users to view and edit their profile and see payment history.",
  "frontend/src/pages/PublicProfilePage.tsx": "Displays a public user profile with stats and event results grouped by event.",
  "frontend/src/pages/SolveFlowPage.tsx": "Manages the full solve attempt flow including session recovery, inspection, timing, and submission for competition events.",
  "frontend/src/types/admin.ts": "Type definitions for admin-related data structures such as results, public profiles, and user summaries.",
  "frontend/src/types/backend-extended.ts": "Locally extended backend type definitions including competitions, results, leaderboards, and session state.",
  "frontend/src/types/domain.ts": "Provides event labels and constants defining available events and the default event.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Metadata describing the project state, architecture, features, and known issues for the speedcubing platform."
}