{
  "backend/main.mo": "Defines competition, event, payment, result, and profile types with authorization mixin and comparison utilities, and stores user payment mappings.",
  "feature_evidence.json": "Lists feature evidence entries describing required frontend fixes, diagnostics, and payment‑flow behavior tied to specific files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files describing their roles in routing, UI, payment flow, and competition features.",
  "frontend/index.css": "Tailwind base/theme configuration defining light and dark mode CSS variables and shared styles.",
  "frontend/index.html": "Root HTML document loading the React application via main.tsx.",
  "frontend/public/razorpay.config.json": "Razorpay client configuration specifying key, currency, branding, and theme.",
  "frontend/src/api/errors.ts": "Maps backend and payment errors to user-friendly English messages for UI display.",
  "frontend/src/api/queryKeys.ts": "Defines stable React Query key generators for competitions, profiles, results, and payment status.",
  "frontend/src/App.tsx": "Sets up routing, React Query, theming, and global app shell while enforcing profile setup after login.",
  "frontend/src/components/auth/AdminGuard.tsx": "Admin-only guard that checks allowlist permissions and shows a styled access-denied state when unauthorized.",
  "frontend/src/components/auth/LoginButton.tsx": "A login/logout button that triggers Internet Identity auth, handles errors, and updates React Query cache.",
  "frontend/src/components/auth/RequireAuth.tsx": "A wrapper that blocks access until Internet Identity is initialized and authenticated, showing a login prompt if not.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Displays a competition summary card with status, dates, participant limit, and navigation to its detail page.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout with header, navigation, auth controls, and footer, with a special minimal header for solve flow pages.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Renders a leaderboard table computing Ao5 from results and showing ranked competitors with formatted times.",
  "frontend/src/components/profile/PaymentsPurchasesSection.tsx": "Shows the user’s payment history with loading, empty, and error states, including competition and amount details.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Profile dialog allowing users to view/edit profile fields, manage payments tab, and log out via Internet Identity.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog for entering email and display name, submitting them via hooks to create a user profile.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Manages 15‑second inspection countdown with penalty/DNF logic and displays scramble and timer UI.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Displays completion message for all solves and provides navigation to leaderboard or competition page.",
  "frontend/src/components/solve/SolveTimer.tsx": "Start/stop solve timer tracking milliseconds and reporting final time through a callback.",
  "frontend/src/config/razorpay.ts": "Loads and caches Razorpay config from a JSON file with a fallback default configuration.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to user identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Warns users before leaving the page when enabled by adding a beforeunload listener.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user's profile using the backend actor and manages loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, managing login, stored identity, and status.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser back navigation when enabled, prompting the user to confirm leaving during a solve.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods, including user profiles, competitions, payments, and Razorpay integration.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/ao5.ts": "Provides utilities for computing average-of-5 (Ao5) times and a leaderboard entry type.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into readable date strings.",
  "frontend/src/lib/razorpay.ts": "Loads Razorpay’s checkout script and exposes functions to open the Razorpay payment dialog.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times into seconds with two‑digit decimals, handling DNF cases.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Admin form for creating competitions, handling event selection, scrambles, payment settings, validation, and submission to the backend.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Displays detailed competition info, manages event selection, result fetching, and payment flow using Razorpay.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Lists competitions grouped by status with loading and empty states.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows a competition leaderboard with event selection, profile lookup, and result display.",
  "frontend/src/pages/SolveFlowPage.tsx": "Implements the full solve flow including inspection, solving, submission, navigation blocking, and updating attempt state for a competition event.",
  "frontend/src/types/domain.ts": "Defines event labels, the list of all events, and the default event used throughout the app.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color variables, animations, and enabled plugins.",
  "project_state.json": "JSON snapshot documenting the project's architecture, features, issues, and development state."
}