{
  "backend/main.mo": "Main Motoko actor defining competitions, payments, profiles, results, and authorization, including event comparison logic and data models.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding userPayments while preserving existing state.",
  "feature_evidence.json": "Feature evidence report mapping product features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend components, hooks, and pages.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and global base styles.",
  "frontend/index.html": "HTML entry point defining root container and loading the main React script.",
  "frontend/public/razorpay.config.json": "Static Razorpay config providing keyId, currency, branding, and theme settings.",
  "frontend/src/api/errors.ts": "Utility for normalizing backend error messages into user-friendly text.",
  "frontend/src/api/queryKeys.ts": "Centralized React Query key definitions for competitions, profiles, results, and payments.",
  "frontend/src/App.tsx": "Main React application setup with routing, theming, query client, and profile setup handling.",
  "frontend/src/components/auth/AdminGuard.tsx": "Component that checks if the user is an allowlisted admin and displays a loading or access-denied screen before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout state and displays an appropriate button with loading and error handling.",
  "frontend/src/components/auth/RequireAuth.tsx": "Gate component that requires user authentication, showing a login prompt or loading spinner before rendering children.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Renders a clickable card showing competition details, status, and navigation to the competition page.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout providing header, navigation, footer, and special handling for solve-flow pages with admin and auth UI logic.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Displays a leaderboard table with ranks, Ao5 calculation, attempt details, and optional profile display names.",
  "frontend/src/components/profile/PaymentsPurchasesSection.tsx": "Shows a user's payment history with loading/error states, sorting, and detailed card-style entries.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Profile dialog enabling viewing and editing user profile details, tabs for profile and payments, and logout functionality.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog component that collects email and display name, sets user email, and creates a user profile via mutations.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Manages the 15‑second inspection timer with penalty logic, showing scramble and invoking completion with penalties.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Displays a completion message after all solves and provides navigation to leaderboard or back to competition.",
  "frontend/src/components/solve/SolveTimer.tsx": "Implements a solve timer with start/stop controls, tracking milliseconds and reporting final time.",
  "frontend/src/config/razorpay.ts": "Loads Razorpay public configuration with caching and provides a fallback default config.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a beforeunload listener to warn users about leaving when enabled.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user's profile using the actor once available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling auth client creation, login, identity loading, and state management.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser back navigation when enabled by prompting the user to confirm leaving.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating competition, user, payment, and result data through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark theme colors and layout.",
  "frontend/src/lib/ao5.ts": "Implements Ao5 calculation logic for five attempts and defines leaderboard entry types.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into readable dates using US locale.",
  "frontend/src/lib/razorpay.ts": "Loads Razorpay’s checkout script and opens the payment modal with configured options and handlers.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times into seconds.milliseconds strings and handles DNF values.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Admin UI for creating competitions, collecting metadata, events, scrambles, and fees, then submitting via createCompetition API.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Displays competition details, handles event selection, payment flow, and starting a competition.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Fetches competitions and renders running, upcoming, and completed lists with loading states.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows competition leaderboard, fetching competition data, results, and public profiles for display.",
  "frontend/src/pages/SolveFlowPage.tsx": "Manages a full solve session with inspection, solving, submission, and attempt flow, using queries to load competition data and submit attempts.",
  "frontend/src/types/domain.ts": "Defines event labels, full event list, and the default event used throughout the app.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, container settings, and registering plugins.",
  "project_state.json": "Describes the project’s state, architecture, features, and known issues for the speedcubing platform."
}