{
  "backend/main.mo": "Main Motoko actor defining competition, user, result types and maps, admin allowlist logic, and comparison helpers for events and results.",
  "backend/migration.mo": "Migration module providing a no-op upgrade from the old actor state to a new empty state.",
  "feature_evidence.json": "Feature evidence report listing the updated AdminGuard requirement and referencing affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries for all major frontend components, pages, hooks, and API utilities.",
  "frontend/index.css": "Tailwind CSS root theme variables and dark mode overrides for global styling.",
  "frontend/index.html": "Base HTML document loading the React app and main script entrypoint.",
  "frontend/src/api/errors.ts": "Utility for converting backend error messages into user-friendly strings.",
  "frontend/src/api/queryKeys.ts": "Centralized React Query key definitions for competitions, profiles, results, and admin checks.",
  "frontend/src/App.tsx": "Root React app configuring routing, theme, query client, and profile-setup gating.",
  "frontend/src/components/auth/AdminGuard.tsx": "Admin-only access wrapper using backend admin check with updated messaging for multiple allowlisted admins.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling dual-state authentication and query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard that blocks unauthenticated users and shows a login prompt.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Renders a clickable card showing competition name, status, dates, participant limit, and basic event info, navigating to the competition page on click.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with header, navigation, footer, and special handling for the solve flow view.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Displays a leaderboard table computing Ao5 scores, showing ranks, competitor names, and formatted solve times with penalties.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Shows the user's profile info with an inline editor allowing display name updates via profile mutation hooks.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog for first‑time users to enter email and display name, submitting via profile creation and email‑setting hooks.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Runs the 15‑second inspection countdown with +2 and DNF thresholds, showing scramble and signaling completion with penalty.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Presents a completion screen after all solves with buttons to view the leaderboard or return to the competition page.",
  "frontend/src/components/solve/SolveTimer.tsx": "A timer component that tracks solve duration, displays running state, and reports the final time via onComplete.",
  "frontend/src/config/razorpay.ts": "Exports test-mode Razorpay configuration including key, currency, branding, and theme.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a beforeunload warning when enabled to prevent accidental page exit.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the caller’s user profile using the actor, handling load state and query control.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser navigation when enabled and prompts the user before allowing back navigation.",
  "frontend/src/hooks/useQueries.ts": "Defines various React Query hooks for user profiles, admin checks, competitions, results, and mutations via the actor.",
  "frontend/src/index.css": "Tailwind base styles with CSS variables for themes and color palettes including dark mode.",
  "frontend/src/lib/ao5.ts": "Calculates average-of-five solve times handling DNFs and exports a leaderboard entry type.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into human-readable dates.",
  "frontend/src/lib/razorpay.ts": "Loads the Razorpay script and opens the checkout widget with configured options and callbacks.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond solve times into seconds.milliseconds or returns DNF for invalid values.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Admin form for creating competitions, selecting events, configuring scrambles, and submitting to backend.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Shows competition details, manages event selection, payment, and starting a competition session.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Fetches and displays competitions grouped by status with loading and empty states.",
  "frontend/src/pages/LeaderboardPage.tsx": "Loads competition leaderboard data, filters completed results, and displays them with user profiles.",
  "frontend/src/pages/SolveFlowPage.tsx": "Controls the solve workflow including inspection, timing, submitting attempts, and progressing through attempts.",
  "frontend/src/types/domain.ts": "Defines event labels, the full event list, and the default event.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, persisting, and clearing URL parameters and session values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH-based color system, extended animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project's current architecture, features, issues, and admin requirements for a full‑stack online speedcubing platform using Next.js, PostgreSQL, Prisma, and NextAuth."
}