{
  "backend/main.mo": "Main Motoko canister implementing competitions, user profiles, results, payments, and admin authorization with sorting helpers and state maps.",
  "backend/migration.mo": "Migration script converting old user profiles to include new country and gender fields while preserving all other actor state.",
  "feature_evidence.json": "Feature evidence report mapping implemented UI features to files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for reference or documentation generation.",
  "frontend/index.css": "Global Tailwind CSS config defining theme variables and dark mode styles.",
  "frontend/index.html": "Base HTML template mounting the React app via main.tsx.",
  "frontend/src/api/errors.ts": "Utility normalizing backend error messages into readable UI strings.",
  "frontend/src/api/queryKeys.ts": "Central list of React Query keys for competitions, results, profiles, and leaderboards.",
  "frontend/src/App.tsx": "Main React app entry configuring routing, theme, queries, and profile setup triggering.",
  "frontend/src/components/auth/AdminGuard.tsx": "UI guard that checks admin status and blocks access with an error screen if unauthorized.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and query-cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Checks Internet Identity auth state and either shows loading, login prompt, or renders children.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Displays a competition preview card with status, dates, participant limit, and navigation to the competition page.",
  "frontend/src/components/layout/AppShell.tsx": "Renders the main app layout with header, navigation, footer, and special handling for solve flow routes.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Builds a leaderboard table showing ranks, competitors, Ao5, and formatted attempt times using profile data.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Shows a profile button and dialog allowing users to edit and save display name, country, gender, and view MCubes ID.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Displays a setup dialog for new users to enter email and display name, then creates their profile.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Manages the inspection countdown with penalties and reveals scramble before invoking completion callback.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Displays a post-solve screen with navigation buttons to the leaderboard or competition page.",
  "frontend/src/components/solve/SolveTimer.tsx": "Provides a start/stop solve timer with formatted display and onComplete callback.",
  "frontend/src/config/razorpay.ts": "Defines test-mode Razorpay configuration values for payments.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a beforeunload browser warning when enabled.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user’s profile using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication, managing login state and identity loading.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser navigation with a confirmation prompt when enabled.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user, competition, results, and admin actions via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/ao5.ts": "Computes average-of-five results and defines leaderboard entry structure.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into readable dates.",
  "frontend/src/lib/razorpay.ts": "Loads Razorpay script and opens payment checkout with configured options.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times into seconds.milliseconds or returns DNF.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Admin form for creating competitions with events, scrambles, fees, and metadata.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Displays competition details, event selection, payment flow, and starting logic.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Fetches and displays competitions grouped by status with loading states.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows leaderboard for a competition event, fetching profiles and handling loading states.",
  "frontend/src/pages/SolveFlowPage.tsx": "Manages inspection, solve timing, attempt submission, and navigation protection for solving.",
  "frontend/src/types/domain.ts": "Defines event constants, labels, list of all events, and default event.",
  "frontend/src/utils/urlParams.ts": "Helpers to read, persist, and clear URL parameters, including session-backed storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom color tokens, extended theme settings, animations, and typography/container-query/animate plugins.",
  "project_state.json": "JSON describing the project's current state, architecture notes, known issues, and existing features for a full‑stack speedcubing competition platform."
}