{
  "backend/main.mo": "Defines the Motoko canister's core types for competitions, events, payments, results, user profiles, and ordering utilities, and mixes in authorization. Includes custom comparison logic for event ordering.",
  "feature_evidence.json": "Feature evidence report describing required admin result hide/unhide functionality and associated affected frontend files.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files including components, pages, and hooks used across the app.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and applying base styles for the app.",
  "frontend/index.html": "Base HTML template mounting the React application and loading main.tsx.",
  "frontend/public/razorpay.config.json": "Razorpay public config defining live keyId, currency, company info, and theme color.",
  "frontend/src/api/errors.ts": "Maps backend error messages to user-friendly strings covering sessions, scrambles, payments, authorization, and generic failures.",
  "frontend/src/api/queryKeys.ts": "Defines React Query cache keys for competitions, results, profiles, admin data, and solve-session state.",
  "frontend/src/App.tsx": "Sets up TanStack router routes, query client, theme provider, and links all main application pages including admin routes.",
  "frontend/src/components/auth/AdminGuard.tsx": "Admin-only guard that checks caller admin status and displays a loading spinner or access denied message accordingly.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity, handling authentication state and retry logic on errors.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content and displays a login prompt or loading state when the user is not authenticated.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Renders a clickable competition card showing name, status, dates, and participant info, navigating to the competition page.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with navigation, header, footer, and conditional solve-flow mode, showing admin links when applicable.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Displays leaderboard results with ranks, user names, Ao5 times, and individual solves, linking to competitor profiles.",
  "frontend/src/components/profile/PaymentsPurchasesSection.tsx": "Shows the user’s payment history with sorting, loading/error states, and detailed payment cards.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Provides a dropdown menu for authenticated users showing profile info, navigation, and logout functionality.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog for creating a user profile, collecting email and display name and submitting them via mutation hooks.",
  "frontend/src/components/solve/InspectionTimer.tsx": "A React component managing a 15–17 second WCA-style inspection phase with ready, inspecting, and complete states.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Displays a post-solve completion screen with navigation actions and instructions for submitting video evidence.",
  "frontend/src/components/solve/SolveTimer.tsx": "Implements a solve timer with start/stop controls, live time display, and callback on completion.",
  "frontend/src/config/razorpay.ts": "Loads and caches Razorpay configuration from a JSON file with fallback defaults.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a beforeunload listener to warn users about leaving when enabled.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user's profile using the authenticated actor when available.",
  "frontend/src/hooks/useGoLiveAttempt.ts": "Simulates a multi-step deployment process, tracking step status, errors, and diagnostic logs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser back navigation with a confirmation prompt when enabled.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor calls to fetch competitions, profiles, results, leaderboards, and session state.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme CSS variables and base styles.",
  "frontend/src/lib/ao5.ts": "Defines leaderboard entry and computes Ao5 by handling penalties and DNF logic.",
  "frontend/src/lib/csv.ts": "Exports competition results to a downloadable CSV with escaped values and formatted attempt times.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into short US locale dates.",
  "frontend/src/lib/goLiveDiagnostics.ts": "Simulates multi‑step deployment with callbacks, random failures, and error normalization.",
  "frontend/src/lib/goLivePreflight.ts": "Runs preflight checks for config files, Razorpay setup, connectivity, and build artifacts.",
  "frontend/src/lib/razorpay.ts": "Loads Razorpay script and opens a configured checkout modal for payments.",
  "frontend/src/lib/solveSession.ts": "Manages tab‑scoped solve session tokens using sessionStorage with helpers to store, retrieve, and clear.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times or DNF values into readable time strings.",
  "frontend/src/main.tsx": "Initializes React root and wraps the app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/admin/AdminCompetitionsPage.tsx": "Displays all competitions for admins with actions to create, edit, lock/unlock, and delete. Uses dialogs and API mutations to manage competition lifecycle.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Provides a form for admins to create a competition with metadata, events, and scrambles. Validates inputs and submits a structured CompetitionInput to the backend.",
  "frontend/src/pages/admin/AdminEditCompetitionPage.tsx": "Loads an existing competition for editing and allows updating metadata, event selection, and scrambles. Submits updated CompetitionInput via admin API.",
  "frontend/src/pages/admin/AdminGoLivePage.tsx": "Runs preflight checks and a multi‑step deployment process with diagnostics viewing, copying, and downloading. Uses custom hooks to manage go‑live state and steps.",
  "frontend/src/pages/admin/AdminLandingPage.tsx": "Admin dashboard with navigation to user, competition, results management, and quick actions like creating competitions or starting go‑live. Provides visual section cards for core admin areas.",
  "frontend/src/pages/admin/AdminResultsPage.tsx": "Admin page for selecting competitions and events, viewing results, recalculating leaderboards, toggling visibility, and exporting CSVs.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin interface for listing users and performing actions like block, unblock, delete, reset competition status, and view solve history.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Competition detail page that fetches competition data, handles event selection, payment via Razorpay, and starts the competition flow.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Displays lists of running, upcoming, and completed competitions with loading states and category sections.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows a competition leaderboard for a selected event, loading states, and user navigation to public profiles.",
  "frontend/src/pages/LeaderboardsHubPage.tsx": "Leaderboards hub listing all competitions with status badges and navigation to each competition's leaderboard.",
  "frontend/src/pages/ProfilePage.tsx": "Authenticated user profile page allowing editing of personal info and viewing payment history.",
  "frontend/src/pages/PublicProfilePage.tsx": "Public profile page showing a user’s basic info and aggregated competition results and stats.",
  "frontend/src/pages/SolveFlowPage.tsx": "Handles the full solving flow including session recovery, inspection, timing, attempt submission, and navigation blocking. Integrates API queries to load session state, scrambles, and submit attempts.",
  "frontend/src/types/admin.ts": "Defines admin-related data types including result input structure, public profile info, and user summary model.",
  "frontend/src/types/domain.ts": "Provides event labels, event list, and default event constants used throughout the app.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-based parameters, including hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata with architecture notes, known issues, and feature history for the speedcubing platform."
}