{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, competitions, and result storage with comparison utilities and authorization mixin.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing components, pages, hooks, and utilities.",
  "frontend/index.css": "TailwindCSS setup defining design tokens, theming variables, and dark mode overrides.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/api/errors.ts": "Utility that converts backend error messages into standardized user-friendly strings.",
  "frontend/src/api/queryKeys.ts": "Centralized React Query key definitions for caching competitions, profiles, admin state, and results.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, root layout, route tree, and first‑time user profile setup handling.",
  "frontend/src/components/auth/AdminGuard.tsx": "Admin-only access wrapper that shows a permission check loader or an access denied screen.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button managing auth state, errors, and query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard that blocks content and prompts login when the user is not authenticated.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Displays a clickable competition card showing name, status, dates, participant limit, and navigate-to details.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with header, navigation, conditional solve-flow UI, and footer.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Renders a leaderboard table with ranks, icons, Ao5 times, and individual solve results.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Shows the user's profile name with inline editing and saving functionality.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Displays a modal for new users to create a display name and submit their profile.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Implements the 15s inspection countdown with penalty/DNF handling before a solve.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Shows a completion screen after all solves with navigation to leaderboard or competition page.",
  "frontend/src/components/solve/SolveTimer.tsx": "Handles the main solve timer with start/stop logic and formatted time output.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a beforeunload prompt when enabled to warn users about leaving the page.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current caller's user profile once an actor is available and manages loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing identity loading, login, logout, and status.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser back navigation when enabled by confirming before allowing navigation.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for admin checks, profile operations, competitions, results, and attempt submission.",
  "frontend/src/index.css": "Tailwind base theme setup defining color variables and global styles including dark mode.",
  "frontend/src/lib/ao5.ts": "Calculates average-of-5 scores handling DNFs and provides a leaderboard entry type.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint nanosecond timestamps into a short US date string.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times into seconds.milliseconds or DNF for invalid values.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and Internet Identity provider.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Admin form for creating competitions, capturing metadata and scrambles, then submitting to the backend and navigating to the new competition.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Displays detailed competition info and allows starting, continuing, or viewing results based on user state.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Lists competitions grouped by status with loading handling and category sections.",
  "frontend/src/pages/LeaderboardPage.tsx": "Fetches competition data and results, computes Ao5 leaderboard entries with profiles, sorts them, and renders a leaderboard table or empty state.",
  "frontend/src/pages/SolveFlowPage.tsx": "Manages the full solve workflow including inspection, solving, attempt submission, and transition between five attempts with navigation blocking.",
  "frontend/src/types/domain.ts": "Defines event types, human-readable labels, and a default event constant.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Describes project metadata, architecture notes, existing features, and system state for the speedcubing platform."
}