{
  "backend/main.mo": "Defines the main Motoko actor with authorization mixin, event ordering logic, and all core types for competitions, payments, results, and user profiles.",
  "backend/migration.mo": "Provides a migration function converting competitions with a single entryFee into the new feeMode-based structure.",
  "feature_evidence.json": "Lists feature evidence mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes.",
  "frontend/index.html": "Root HTML page loading the React app via main.tsx.",
  "frontend/public/razorpay.config.json": "Stores Razorpay payment configuration including key, currency, and theme.",
  "frontend/src/api/errors.ts": "Normalizes backend and client error messages into user-friendly strings, covering sessions, payments, authorization, and competitions.",
  "frontend/src/api/queryKeys.ts": "Defines a set of typed React Query cache keys for competitions, user data, admin data, and solve sessions.",
  "frontend/src/App.tsx": "Sets up routing, providers, and all application pages using TanStack Router and React Query.",
  "frontend/src/components/admin/CompetitionPricingFields.tsx": "Provides a form UI for selecting and configuring different competition pricing modes and updates the parent with the chosen fee structure.",
  "frontend/src/components/auth/AdminGuard.tsx": "Guards admin-only routes by checking admin status and showing loading or access-denied states when appropriate.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity and handles authentication state, login retries, and cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Protects routes requiring authentication, showing a login prompt or loading state when the user is not authenticated.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Displays a competition summary card with status, dates, limits, and navigates to the competition detail page when clicked.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main application layout with header, navigation, footer, and special handling for solve-flow pages.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Renders a leaderboard table with ranks, profiles, Ao5 calculation, and navigation to competitor public profiles.",
  "frontend/src/components/profile/PaymentsPurchasesSection.tsx": "Displays the user's payment history with sorting, loading, and error states using cards and scrollable layout.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Renders a dropdown profile menu showing user info and providing navigation and logout actions.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog for creating a new user profile by submitting email and display name.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Implements a 15-second inspection timer with penalty and DNF handling before a solve.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Shows a post-solve completion screen with navigation actions and instructions for submitting video evidence.",
  "frontend/src/components/solve/SolveTimer.tsx": "Provides a solve timer with start/stop controls and formatted time output, calling a callback on completion.",
  "frontend/src/config/razorpay.ts": "Loads and caches Razorpay frontend config from a JSON file with fallback defaults.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a beforeunload handler to warn users when leaving a page if enabled.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the caller’s user profile once an actor is available and not loading.",
  "frontend/src/hooks/useGoLiveAttempt.ts": "Manages a multi‑step simulated deployment flow with step tracking, errors, and diagnostic logs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/clear actions, and identity initialization via context.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser back navigation via a confirmation prompt when enabled.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for competitions, profiles, results, and leaderboards using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for light and dark themes.",
  "frontend/src/lib/ao5.ts": "Computes average‑of‑5 scores with DNF rules for time attempts.",
  "frontend/src/lib/competitionPricing.ts": "Utility functions to determine paid competitions and format fee information.",
  "frontend/src/lib/csv.ts": "Exports competition results to a downloadable CSV file with formatted attempt data.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into a readable date string.",
  "frontend/src/lib/goLiveDiagnostics.ts": "Simulates a multi-step deployment process with random failures and provides utilities to generate and normalize deployment error messages.",
  "frontend/src/lib/goLivePreflight.ts": "Runs preflight checks for config files, payment settings, network reachability, and build artifacts before deployment.",
  "frontend/src/lib/razorpay.ts": "Loads the Razorpay checkout script and opens the payment UI using backend-provided order data.",
  "frontend/src/lib/solveSession.ts": "Manages tab-scoped solve session tokens using sessionStorage with utilities to store, retrieve, and clear them.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times into seconds with hundredths or returns DNF for invalid values.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminCompetitionsPage.tsx": "Lists all competitions for admins with actions to create, edit, delete, and lock or unlock competitions.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Form page for admins to create a competition, including event selection, scrambles, status, and pricing validation.",
  "frontend/src/pages/admin/AdminEditCompetitionPage.tsx": "Allows admins to edit an existing competition’s details, events, scrambles, and pricing with preloaded data.",
  "frontend/src/pages/admin/AdminGoLivePage.tsx": "Runs preflight checks and executes a multi‑step go‑live process with diagnostics and status tracking.",
  "frontend/src/pages/admin/AdminLandingPage.tsx": "Admin dashboard linking to management sections and providing quick actions like creating competitions or starting go‑live.",
  "frontend/src/pages/admin/AdminResultsPage.tsx": "Interface for viewing, recalculating, exporting, and toggling visibility of competition results per event.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin page listing users with search, and actions to block, unblock, delete, view solve history, and reset competition status.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Displays competition details, handles event selection, payment flow, and starting a solve session.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Lists competitions grouped by status with loading handling and visual sections.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a competition leaderboard with event filtering, loading states, and competitor navigation.",
  "frontend/src/pages/LeaderboardsHubPage.tsx": "Shows a list of competitions with status badges and links to each competition’s leaderboard.",
  "frontend/src/pages/ProfilePage.tsx": "Provides authenticated users a profile editor with display name, country, gender fields, and payment history tabs.",
  "frontend/src/pages/PublicProfilePage.tsx": "Displays a public competitor profile with basic info, stats, and event-grouped results.",
  "frontend/src/pages/SolveFlowPage.tsx": "Manages the timed solve flow for competitions including inspection, solving, submission, and session recovery.",
  "frontend/src/types/admin.ts": "Defines admin-only types for result inputs, public profile info, and a lightweight UserSummary model.",
  "frontend/src/types/backend-extended.ts": "Provides extended frontend typings mirroring backend models, including competitions, results, leaderboards, and session state.",
  "frontend/src/types/domain.ts": "Maps Event enums to display labels and defines constants for all events and the default event.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-based parameters, including hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theming, colors, animations, and plugin integration.",
  "project_state.json": "Project state snapshot describing the platform’s features, architecture notes, issues, and roadmap metadata."
}