{
  "backend/main.mo": "Defines Motoko types for competitions, results, payments, and event comparison helpers used by the backend actor.",
  "feature_evidence.json": "Lists feature evidence entries referencing affected frontend files, components, and test IDs for recent fixes.",
  "frontend-file-summaries.txt": "Provides short human-written summaries of key frontend files for documentation and planning.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/public/env.json": "Defines environment variables such as the backend canister ID.",
  "frontend/public/razorpay.config.json": "Provides Razorpay payment configuration including keyId and theme color.",
  "frontend/REGRESSION_SMOKE_TEST_CHECKLIST.md": "Manual regression and smoke test checklist covering authentication, competition flow, solve flow, and timers.",
  "frontend/src/api/errors.ts": "Maps various backend error messages to user-friendly strings for display.",
  "frontend/src/api/queryKeys.ts": "Defines React Query cache keys and key factories for API data fetching.",
  "frontend/src/App.tsx": "Sets up the React app’s router, routes, and global providers including React Query and ThemeProvider.",
  "frontend/src/components/admin/CompetitionPricingFields.tsx": "Renders form controls for selecting and configuring competition fee modes, syncing changes upward.",
  "frontend/src/components/auth/AdminGuard.tsx": "Restricts access to admin-only sections, showing loaders or an access-denied message as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content, requiring authentication and prompting login when unauthenticated.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Displays a clickable card summarizing a competition’s status, dates, and event count.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header navigation, authentication controls, and mobile menu handling.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Renders a leaderboard table showing ranks, competitor names, Ao5, and solve times with navigation to profiles.",
  "frontend/src/components/profile/PaymentsPurchasesSection.tsx": "Displays the user’s payment history with sorting, loading states, and detailed payment cards.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Provides a dropdown menu for authenticated users with profile info, navigation, and logout handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog for creating a new user profile, collecting email and display name, and submitting via mutations.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Handles a 15‑second inspection countdown with scramble visibility toggling and callbacks for start and completion.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Shows a post‑solve completion screen with navigation options and instructions for submitting video evidence.",
  "frontend/src/components/solve/SolveTimer.tsx": "A React timer component that starts, updates, and stops a solve timer, reporting the final time to a parent callback.",
  "frontend/src/components/system/ActorInitializationError.tsx": "Displays an error message when actor initialization fails and provides retry and troubleshooting guidance.",
  "frontend/src/config/razorpay.ts": "Loads Razorpay configuration from a runtime JSON file with fallback defaults and caches the result.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a beforeunload browser warning when enabled to prevent accidental page exits.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the authenticated user's profile once an actor is available, integrating with React Query.",
  "frontend/src/hooks/useGoLiveAttempt.ts": "Manages state and step-by-step simulation for a deployment attempt, including preflight checks and diagnostic logging.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login flow, and identity persistence via React context.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser back navigation when enabled by prompting the user to confirm leaving an in-progress solve.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with backend APIs related to auth, profiles, competitions, payments, and results.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/src/lib/ao5.ts": "Provides interfaces and logic to compute average-of-five results, handling penalties and DNF conditions.",
  "frontend/src/lib/competitionPricing.ts": "Utility functions to detect paid competitions and format or extract fee values from pricing modes.",
  "frontend/src/lib/csv.ts": "Exports competition results to CSV and provides generic CSV generation and download helpers with value escaping.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into human-readable dates and date-times using US locale settings.",
  "frontend/src/lib/goLiveDiagnostics.ts": "Simulates a multi‑step deployment process with status callbacks and produces detailed error messages.",
  "frontend/src/lib/goLivePreflight.ts": "Runs preflight checks for environment files, payment config, network connectivity, and build artifacts.",
  "frontend/src/lib/razorpay.ts": "Loads the Razorpay checkout script and opens the payment modal using configuration and order details.",
  "frontend/src/lib/solveSession.ts": "Manages per‑tab solve session data in sessionStorage, including token and attempt persistence.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times into seconds.milliseconds or returns DNF for invalid values.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClient and Internet Identity before rendering the root component.",
  "frontend/src/pages/admin/AdminCompetitionsPage.tsx": "Lists all competitions for admins with actions to create, edit, lock, activate, and delete entries.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Provides a form for admins to create competitions, validate inputs, configure events, scrambles, and fees.",
  "frontend/src/pages/admin/AdminEditCompetitionPage.tsx": "Allows admins to edit an existing competition, loading data and validating event scrambles and fees.",
  "frontend/src/pages/admin/AdminGoLivePage.tsx": "Runs deployment preflight checks and step-by-step go-live actions with diagnostics and status indicators.",
  "frontend/src/pages/admin/AdminLandingPage.tsx": "Admin dashboard linking to user, competition, results management, and quick actions like creating competitions or deployment.",
  "frontend/src/pages/admin/AdminResultsPage.tsx": "Admin page to view competition results, filter by event, toggle result visibility, and export results as CSV.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin interface to list users, toggle block status, and delete user accounts with confirmation.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Displays competition details, handles event selection, payment flow, and starting or resuming a solve session.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Fetches and lists competitions grouped by status with cards for running, upcoming, and completed events.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows a competition leaderboard with event selection, error handling, and competitor navigation.",
  "frontend/src/pages/LeaderboardsHubPage.tsx": "Provides an authenticated hub listing all competitions with quick navigation to their leaderboards.",
  "frontend/src/pages/ProfilePage.tsx": "Allows authenticated users to view and edit profile info and access their payment history via tabs.",
  "frontend/src/pages/PublicProfilePage.tsx": "Displays a public competitor profile with stats and event‑grouped results, with navigation back to leaderboards.",
  "frontend/src/pages/SolveFlowPage.tsx": "Controls the solve flow with inspection, timing, session syncing, and refresh recovery for competition attempts.",
  "frontend/src/types/admin.ts": "Defines admin-side types for result input, public profiles, and summarized user data.",
  "frontend/src/types/backend-extended.ts": "Local extensions of backend types including competitions, results, leaderboards, and session state definitions.",
  "frontend/src/types/domain.ts": "Provides event labels, list of all events, and default event selection.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, containers, and plugins.",
  "project_state.json": "High-level project snapshot describing features, issues, architecture, and version metadata."
}