{
  "backend/main.mo": "Defines event comparison logic and extensive types for competitions, payments, user profiles, attempts, and results.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides short descriptive summaries of various frontend components, pages, and utilities.",
  "frontend/index.css": "Tailwind CSS setup with light/dark theme CSS variables and global styles.",
  "frontend/index.html": "Basic HTML shell loading the React app root and main script.",
  "frontend/public/env.json": "Stores backend canister ID for environment configuration.",
  "frontend/public/razorpay.config.json": "Razorpay payment configuration including key, currency, branding, and theme.",
  "frontend/REGRESSION_SMOKE_TEST_CHECKLIST.md": "Manual regression and smoke test checklist covering authentication, competitions, payments, and solve flow recovery.",
  "frontend/src/api/errors.ts": "Maps various backend error messages to user-friendly strings via a normalizeError function.",
  "frontend/src/api/queryKeys.ts": "Defines reusable React Query keys for auth, competitions, sessions, leaderboards, and admin data.",
  "frontend/src/App.tsx": "Main React app entry defining routes, providers, and global application structure.",
  "frontend/src/components/admin/CompetitionPricingFields.tsx": "Renders form fields for selecting and configuring competition pricing modes, updating FeeMode on changes.",
  "frontend/src/components/auth/AdminGuard.tsx": "Protects admin routes by checking identity and admin status, showing loading or access-denied states.",
  "frontend/src/components/auth/LoginButton.tsx": "Displays a login/logout button using Internet Identity with loading handling and query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content and prompts users to log in if unauthenticated, with a loading state.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Shows a clickable competition card with status, dates, participant limit, and event count, navigating on click.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with navigation, header, mobile menu, auth display, and admin links.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Renders a leaderboard table showing ranks, competitor names, average of 5, and individual solve times with penalties. Handles profile lookup, navigation, and rank icon display.",
  "frontend/src/components/profile/PaymentsPurchasesSection.tsx": "Displays a user's payment history with sorting, loading/error states, and detailed cards for each payment. Shows competition info, amount, date, and payment ID.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Provides a profile dropdown menu showing user info and navigation options. Supports logging out and loading states.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog for creating a new user profile by submitting email and display name. Handles email setup and profile creation with validations.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Implements a 15‑second inspection countdown with scramble visibility toggle. Notifies parent on start and completion using stable callbacks.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Shows a completion screen after finishing all solves with navigation actions. Includes instructions for submitting video evidence.",
  "frontend/src/components/solve/SolveTimer.tsx": "Interactive solve timer component that tracks elapsed time, handles start/stop actions, and reports results to a parent callback.",
  "frontend/src/components/system/ActorInitializationError.tsx": "Displays a connection error message with troubleshooting steps and a retry button.",
  "frontend/src/config/razorpay.ts": "Loads Razorpay payment configuration at runtime with caching and fallback defaults.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a beforeunload browser warning when enabled to prevent accidental page exit.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current caller's user profile once an actor is available.",
  "frontend/src/hooks/useGoLiveAttempt.ts": "Manages a multi‑step deployment simulation with preflight checks, step tracking, diagnostics, and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout helpers, and persisted identity management.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser navigation with a confirmation dialog when enabled.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for authentication, profiles, admin checks, competitions, results, and payments; converted types mirror backend structures.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/src/lib/ao5.ts": "Provides types and a function to calculate an average-of-five puzzle score with DNF handling.",
  "frontend/src/lib/competitionPricing.ts": "Determines if competitions are paid and formats or extracts pricing information based on fee modes.",
  "frontend/src/lib/csv.ts": "Exports competition results to CSV and includes utilities for generating and downloading CSV files.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into readable dates and date-times using US locale options.",
  "frontend/src/lib/goLiveDiagnostics.ts": "Simulates deployment steps with progress callbacks, random failure simulation, and error normalization.",
  "frontend/src/lib/goLivePreflight.ts": "Runs preflight checks for environment, payment config, connectivity, and build artifacts, returning failures if any.",
  "frontend/src/lib/razorpay.ts": "Loads the Razorpay SDK and opens the payment checkout with configured options and success handling.",
  "frontend/src/lib/solveSession.ts": "Stores, retrieves, and clears solve session tokens and attempts in sessionStorage with Uint8Array handling.",
  "frontend/src/lib/timeUtils.ts": "Formats times in milliseconds into seconds.millisecond strings, returning DNF for invalid values.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context, applying global CSS.",
  "frontend/src/pages/admin/AdminCompetitionsPage.tsx": "Displays all competitions to admins with actions to create, edit, delete, lock/unlock, and activate/deactivate them.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Provides a form for admins to create competitions, configure events, scrambles, dates, fees, and submit to the backend with validation.",
  "frontend/src/pages/admin/AdminEditCompetitionPage.tsx": "Allows admins to edit an existing competition’s details, events, scrambles, status, and pricing with data loaded from the backend.",
  "frontend/src/pages/admin/AdminGoLivePage.tsx": "Runs and displays deployment preflight checks and step-by-step progress for deploying the application, with diagnostics export options.",
  "frontend/src/pages/admin/AdminLandingPage.tsx": "Shows the admin dashboard with navigation to user, competition, results management, and quick actions like creating competitions or starting deployment.",
  "frontend/src/pages/admin/AdminResultsPage.tsx": "Admin page for viewing, filtering, exporting, and toggling visibility of competition results using admin query hooks.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin interface for listing users, blocking/unblocking, deleting accounts, viewing solve history, and resetting competition status.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Displays competition details, handles event selection, session start, and paid registration using Razorpay checkout.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Fetches and lists competitions grouped by status with cards for running, upcoming, and completed events.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows leaderboard for a selected competition event, computing ranks and Ao5, with navigation back to competition details.",
  "frontend/src/pages/LeaderboardsHubPage.tsx": "Lists all competitions with status and dates, linking to each competition’s leaderboard; requires authentication.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the authenticated user's profile info and provides access to payment history.",
  "frontend/src/pages/PublicProfilePage.tsx": "Shows a public competitor profile with stats and event‑grouped results, linking back to leaderboards.",
  "frontend/src/pages/SolveFlowPage.tsx": "Implements the solve flow for competitors, handling session recovery, timers, attempt progression, and backend synchronization for a competition event.",
  "frontend/src/types/admin.ts": "Defines admin-side types for results, public profiles, and user summaries used in administrative features.",
  "frontend/src/types/backend-extended.ts": "Local extensions of backend-generated types including competitions, fee modes, results, leaderboards, and session-state responses.",
  "frontend/src/types/domain.ts": "Maps event enums to labels and exports event constants and defaults used across the app.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters for routing and persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and theme settings with plugins for typography and container queries.",
  "project_state.json": "Project-level metadata describing the platform’s features, architecture, known issues, and development state."
}