{
  "backend/main.mo": "Defines event comparisons and core types for competitions, payments, profiles, sessions, attempts, and results inside the main actor.",
  "backend/migration.mo": "Provides a migration that adds Ao5 calculation to stored results by transforming old result entries into the new format.",
  "feature_evidence.json": "Feature evidence record describing required behavior for session start/resume logic and listing affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their purpose and recent behavioral changes.",
  "frontend/index.css": "Tailwind base/theme configuration defining CSS variables for light and dark mode.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/public/env.json": "Public config exposing the backend canister ID.",
  "frontend/public/razorpay.config.json": "Razorpay payment configuration including keyId, currency, company info, and theme settings.",
  "frontend/REGRESSION_SMOKE_TEST_CHECKLIST.md": "Manual QA checklist covering authentication, admin access, competitions, leaderboards, and user management.",
  "frontend/src/api/errors.ts": "Maps various backend error messages to user-friendly strings through a normalizeError helper.",
  "frontend/src/api/queryKeys.ts": "Defines stable React Query keys for competitions, profiles, results, admin data, and solve sessions.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, React Query client, theme provider, and application shell.",
  "frontend/src/components/admin/CompetitionPricingFields.tsx": "UI component for selecting competition pricing modes and editing fee values, emitting a FeeMode object.",
  "frontend/src/components/auth/AdminGuard.tsx": "Protects admin-only pages by checking authentication and admin status, showing loading or denial screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling login/logout with Internet Identity and clearing cached queries on logout.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content requiring authentication, showing a loading state or login prompt if not signed in.",
  "frontend/src/components/competition/CompetitionCard.tsx": "Clickable card displaying competition details and status, navigating to its detail page.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout with header, navigation, auth controls, admin link, and mobile menu wrapper around routed content.",
  "frontend/src/components/leaderboard/LeaderboardTable.tsx": "Renders a leaderboard table showing ranks, competitor names, Ao5, and individual solve times with navigation to profiles.",
  "frontend/src/components/profile/PaymentsPurchasesSection.tsx": "Displays a user's payment history with sorting, loading/error states, and detailed purchase cards.",
  "frontend/src/components/profile/ProfileMenu.tsx": "Provides a user profile dropdown with account info, navigation links, and logout handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog for initial profile setup, allowing users to enter email and display name before creating their profile.",
  "frontend/src/components/solve/InspectionTimer.tsx": "Implements a 15‑second inspection timer with scramble visibility toggle and callbacks for start and completion.",
  "frontend/src/components/solve/SolveCompletionScreen.tsx": "Shows a post‑solve completion screen with navigation options and instructions for video evidence submission.",
  "frontend/src/components/solve/SolveTimer.tsx": "Provides an interactive solve timer that measures time, handles start/stop states, and reports completion.",
  "frontend/src/components/system/ActorInitializationError.tsx": "UI component showing an actor initialization error with retry and troubleshooting guidance.",
  "frontend/src/config/razorpay.ts": "Loads and caches Razorpay config from a JSON file with fallback defaults.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching a backend actor based on identity and refreshing dependent queries.",
  "frontend/src/hooks/useBeforeUnloadWarning.ts": "Adds a browser beforeunload warning when enabled.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user's profile using the actor once available.",
  "frontend/src/hooks/useGoLiveAttempt.ts": "Manages state and execution of a multi‑step simulated deployment process with diagnostics and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity management via AuthClient.",
  "frontend/src/hooks/useNavigationBlocker.tsx": "Blocks browser back navigation with a confirmation prompt when enabled.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for competitions, results, payments, and other backend interactions.",
  "frontend/src/index.css": "Tailwind base styles defining light/dark CSS variables and global styling.",
  "frontend/src/lib/ao5.ts": "Computes average of 5 (Ao5) times handling penalties and DNF logic.",
  "frontend/src/lib/competitionPricing.ts": "Helpers for determining if a competition is paid and formatting pricing details.",
  "frontend/src/lib/csv.ts": "Generates CSV content from results, escapes fields, and triggers file downloads; also provides generic CSV creation and download helpers.",
  "frontend/src/lib/dateUtils.ts": "Formats bigint timestamps into human-readable dates and date-times using US locale settings.",
  "frontend/src/lib/goLiveDiagnostics.ts": "Simulates a multi-step deployment process with optional random failures and provides error normalization utilities.",
  "frontend/src/lib/goLivePreflight.ts": "Runs preflight checks for environment files, payment config, network reachability, and build artifacts, returning detailed failures.",
  "frontend/src/lib/razorpay.ts": "Loads the Razorpay checkout script and opens the payment UI using config values and provided order details.",
  "frontend/src/lib/solveSession.ts": "Manages tab-scoped solve session tokens in sessionStorage, providing store, retrieve, clear, and existence-check helpers.",
  "frontend/src/lib/timeUtils.ts": "Formats millisecond times into seconds with centiseconds and returns DNF for invalid or too-large values.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider, then renders the root component.",
  "frontend/src/pages/admin/AdminCompetitionsPage.tsx": "Lists all competitions for admins with actions to create, edit, delete, lock, and activate competitions.",
  "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx": "Provides a form for admins to create a competition, including events, scrambles, dates, limits, and pricing.",
  "frontend/src/pages/admin/AdminEditCompetitionPage.tsx": "Allows admins to edit an existing competition’s details, events, scrambles, and pricing.",
  "frontend/src/pages/admin/AdminGoLivePage.tsx": "Runs deployment preflight checks and step-by-step deployment to production with diagnostics tools.",
  "frontend/src/pages/admin/AdminLandingPage.tsx": "Admin dashboard offering navigation to manage users, competitions, results, and quick actions like creating competitions or going live.",
  "frontend/src/pages/admin/AdminResultsPage.tsx": "Lets admins filter, view, hide/show, and export competition results for specific competitions and events.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin page that lists all users and provides actions to block, delete, reset competition status, and view solve history using various admin mutations.",
  "frontend/src/pages/CompetitionDetailPage.tsx": "Displays competition details, handles event selection, payment flow, and starting or resuming solve sessions.",
  "frontend/src/pages/CompetitionsListPage.tsx": "Displays competitions fetched from the API, grouped by running, upcoming, and completed, with loading and empty states.",
  "frontend/src/pages/LeaderboardPage.tsx": "Shows a competition’s leaderboard with event selection, ranking, and formatted solve data, handling loading and missing-competition states.",
  "frontend/src/pages/LeaderboardsHubPage.tsx": "Lists all competitions with status and date info, linking to their leaderboards and requiring authentication.",
  "frontend/src/pages/ProfilePage.tsx": "Provides authenticated users a profile editor with fields for display name, country, and gender plus access to payment history.",
  "frontend/src/pages/PublicProfilePage.tsx": "Displays a public competitor profile along with aggregated event results and basic stats, handling loading and not-found cases.",
  "frontend/src/pages/SolveFlowPage.tsx": "Manages the full solve flow including inspection, timing, penalties, scramble fetching, and result submission for a competition event.",
  "frontend/src/types/admin.ts": "Defines admin-specific types including result inputs, public profile info, and user summary structures.",
  "frontend/src/types/backend-extended.ts": "Extends backend types with additional competition, result, leaderboard, profile, and session-related interfaces not exported by the generated backend.",
  "frontend/src/types/domain.ts": "Defines event labels, event lists, and a default event for use across the frontend.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Stores the project's current state, architecture notes, known issues, and feature metadata for the full-stack competition platform."
}