{
  "kind": "build_request",
  "title": "Enable Razorpay live payment flow (order creation + verification) and show user payment history",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Implement a secure Razorpay payment architecture for paid competitions using server-side order creation and server-side payment verification (no Razorpay Key Secret in frontend or repo), so that users must successfully pay before they can start/access a paid competition event.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1 yes , 2 yes, 3 live payments befre accessing comp"
        ]
      },
      "acceptanceCriteria": [
        "Frontend uses Razorpay Key ID only; Razorpay Key Secret is never present in any frontend bundle or committed source code.",
        "Backend exposes an authenticated method to create a Razorpay order for a specific (competitionId, event) and returns the Razorpay order id and amount/currency needed for checkout.",
        "Frontend checkout is opened using an order_id from the backend-created order (not a client-only amount flow).",
        "Backend exposes an authenticated method to verify/confirm payment that validates the Razorpay signature for the order/payment before recording the purchase.",
        "If verification fails, backend rejects confirmation and the user cannot start the competition event.",
        "Attempting to call startCompetition for a paid event without a verified payment continues to fail with a clear error message (English)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Add backend APIs and persisted records to support user-visible purchase history for paid competitions/events, designed so it can be extended for future admin management.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2 yes"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores a payment record per (competitionId, callerPrincipal, event) that includes at minimum: competitionId, event, amount, currency, razorpayOrderId, razorpayPaymentId, verification status, and a timestamp.",
        "Backend provides an authenticated query method for the caller to fetch their payment/purchase history as a list sorted by most-recent first.",
        "Payment-gating checks use verified payment status (not merely the presence of a client-submitted payment id).",
        "Payment history query returns enough data for the UI to display competition name (via competitionId lookup), amount, event, and status."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Add a user-facing Payments/Purchases view in the Profile UI that lists the authenticated user’s paid competition entries and their status.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "better if user could able to see payment or purchase in their account. and in future admin could manage as welll."
        ]
      },
      "acceptanceCriteria": [
        "Profile UI includes a Payments/Purchases section accessible to logged-in users.",
        "The Payments/Purchases section loads from a backend query via React Query and displays: competition name (or competitionId if missing), event label, amount/currency, timestamp, and status (e.g., Verified / Pending / Failed).",
        "If the user has no payments, show an English empty-state message (e.g., \"No purchases yet.\").",
        "Errors are shown as readable English messages using the app’s existing error/toast patterns."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Ensure paid-competition access enforcement is consistent across navigation paths (e.g., direct navigation to solve route) by adding frontend guards and clear English messaging for payment-required states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "3 live payments befre accessing comp"
        ]
      },
      "acceptanceCriteria": [
        "If a user navigates directly to the solve flow for a paid competition event without having started (and without verified payment), the UI shows an English message indicating payment is required and provides a path back to the competition detail page to pay/start.",
        "Competition detail page payment CTA uses the new backend order-creation flow and shows clear loading/processing states.",
        "After a successful verified payment, starting the competition navigates to the solve flow without requiring a manual page refresh."
      ]
    }
  ],
  "constraints": [
    "Do not modify any frontend files under frontend/immutablePaths (compose existing components instead).",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not hardcode or commit Razorpay Key Secret anywhere in the repository or ship it to the client. The user-provided secret (\"28uEFtbhWrRp7RhPiS2uyuvY\") must be treated as compromised and must not be stored in code/config.",
    "Preserve the user-provided Razorpay live Key ID string exactly when configuring live mode: rzp_live_kyn4dKuIvsesAX (but only in the frontend/public configuration where appropriate).",
    "All user-facing text added/changed must be in English."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers beyond Internet Identity.",
    "Implementing real-time payment webhooks or background reconciliation (may be added later).",
    "Building an admin payments management dashboard (only ensure data model/API is extendable for future admin use)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}