{
  "kind": "build_request",
  "title": "Add unhide option to Admin Results visibility toggle",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-72",
      "text": "Fix Admin Results Management so that admins can both hide and unhide a leaderboard entry, and the UI accurately reflects the current hidden state per result row (i.e., not a hide-only action). This must ensure that the admin results list includes a reliable per-result hidden flag from the backend (not a frontend-only guess), and the toggle action can set hidden=false as well as hidden=true.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "View profile is now added, but the hide result from result management in admin works but no option to unhide the action. No other changes"
        ]
      },
      "acceptanceCriteria": [
        "In /admin/results, each result row shows a visibility action that clearly supports both states: when a result is visible, the action hides it; when a result is hidden, the action unhides it.",
        "After hiding a result, reloading /admin/results (or re-selecting competition+event) still shows that row as hidden (state is persisted server-side), and the action available is to unhide.",
        "After unhiding a result, reloading /admin/results still shows that row as visible, and the action available is to hide.",
        "The backend results listing used by the admin UI includes an explicit boolean field indicating whether the result is currently hidden for (competitionId, event, user). The frontend uses this field (not `(result as any).isHidden`).",
        "All user-facing strings introduced/changed for this fix remain English-only (e.g., tooltip and toast text for hide/unhide)."
      ]
    }
  ],
  "constraints": [
    "Do not make unrelated UI/UX or feature changes beyond adding the missing unhide capability in Admin Results Management.",
    "Respect the existing single-actor Motoko backend architecture (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui (immutable Shadcn sources)."
  ],
  "nonGoals": [
    "Do not change the newly added View Profile / public profile functionality.",
    "Do not add new admin sections or new result-editing features beyond the hide/unhide toggle.",
    "Do not implement any new payment, competition, or leaderboard computation changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}