{
  "kind": "build_request",
  "title": "Expand admin allowlist to include thiirdparty.mcubes@gmail.com and/or MCUBES-0",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Update admin authorization so that competition-creation/admin access is granted to either (a) users whose stored email is allowlisted, including \"midhun.speedcuber@gmail.com\" and \"thiirdparty.mcubes@gmail.com\", OR (b) users whose stored mcubes user ID is exactly \"MCUBES-0\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "add thiirdparty.mcubes@gmail.com or MCUBES-0 as admin"
        ]
      },
      "acceptanceCriteria": [
        "A caller with stored email \"midhun.speedcuber@gmail.com\" is recognized as admin (no regression).",
        "A caller with stored email \"thiirdparty.mcubes@gmail.com\" is recognized as admin and can successfully call createCompetition.",
        "A caller whose stored profile mcubesId is exactly \"MCUBES-0\" is recognized as admin and can successfully call createCompetition even if their stored email is not allowlisted.",
        "A caller who matches none of the allowlist rules is denied with an \"Unauthorized\" error when calling createCompetition."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Update the frontend admin gating messaging to reflect that there can be multiple allowlisted administrators (not just a single admin), and ensure the AdminGuard continues to block access to the admin competition creation page when the backend reports the caller is not an admin.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "add thiirdparty.mcubes@gmail.com or MCUBES-0 as admin"
        ]
      },
      "acceptanceCriteria": [
        "When a non-admin visits the admin create competition route, the page shows an access-denied message in English indicating the page is restricted to allowlisted administrators.",
        "When an allowlisted admin visits the admin create competition route, the create competition form renders as before."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); add migration code only if existing stable state needs changes.",
    "Do not edit any frontend files under frontend/src/components/ui or other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add new authentication providers (Internet Identity remains the only auth).",
    "Do not change competition creation fields/validation beyond what is required for admin allowlist expansion.",
    "Do not implement any new admin roles/permissions system beyond the requested allowlist expansion."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}