{
  "kind": "build_request",
  "title": "Fix remaining Admin-side errors by removing stubbed hooks and wiring Admin UI to real backend APIs",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-128",
      "text": "Eliminate remaining \"Backend method not available\"/stub behavior in Admin flows by implementing (or exposing) the missing Motoko backend admin canister methods required by the existing Admin UI for competition management, user management, and results visibility toggling.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "still error from admin side"
        ]
      },
      "acceptanceCriteria": [
        "Backend actor exposes admin-only methods needed by the current frontend Admin pages so they no longer rely on placeholder methods (no traps/errors like \"Backend method not available: adminUpdateCompetition\" from frontend stubs).",
        "All admin-only backend methods enforce the same allowlisted-admin rule already used by `isCallerAdmin()` (admin permission + allowlisted email / mcubesId rule) and return clear English errors on unauthorized access.",
        "Admin competition management backend supports: create, update, delete, lock/unlock, activate/deactivate (matching actions present in `frontend/src/pages/admin/AdminCompetitionsPage.tsx`, `AdminCreateCompetitionPage.tsx`, and `AdminEditCompetitionPage.tsx`).",
        "Admin results backend supports: list competition results for (competitionId,event) including a reliable per-result `isHidden` flag, and toggle hidden true/false.",
        "Admin users backend supports: list users (principal + optional profile + optional email + blocked flag), block/unblock, delete user.",
        "All backend validation errors are in English and do not leak secrets."
      ]
    },
    {
      "id": "REQ-129",
      "text": "Update `frontend/src/hooks/useQueries.ts` to remove admin-related placeholder mutations/queries that throw \"Backend method not available\" and wire them to the real backend actor methods for Admin competitions, Admin users, and Admin results visibility toggling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "still error from admin side"
        ]
      },
      "acceptanceCriteria": [
        "`useAdminCreateCompetition()` no longer throws \"Backend method not available: adminCreateCompetition\" and successfully creates a competition when the caller is an admin; on success it invalidates the relevant queries (`QUERY_KEYS.competitions`, `QUERY_KEYS.adminCompetitions`).",
        "`useAdminUpdateCompetition()` no longer throws \"Backend method not available: adminUpdateCompetition\" and successfully saves edits from the Admin Edit page.",
        "`useAdminDeleteCompetition()`, `useAdminLockCompetition()`, and `useAdminActivateCompetition()` call real backend methods and the Admin competitions list actions succeed without toast errors caused by missing hooks.",
        "`useAdminGetUsers()`, `useAdminBlockUser()`, `useAdminDeleteUser()` (used by `frontend/src/pages/admin/AdminUsersPage.tsx`) load real users and execute actions end-to-end.",
        "`useAdminGetCompetitionResults()` and `useAdminToggleResultVisibility()` (used by `frontend/src/pages/admin/AdminResultsPage.tsx`) load real results and can both hide and unhide, with the UI reflecting `result.isHidden` reliably.",
        "All surfaced UI errors remain English-only and are routed through `normalizeError` where applicable."
      ]
    },
    {
      "id": "REQ-130",
      "text": "Add stable, actionable Admin-page error states so Admin pages do not appear to “hang” when an admin query/mutation fails (e.g., show an inline error panel with normalized English error text and a Retry button that refetches).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "still error from admin side"
        ]
      },
      "acceptanceCriteria": [
        "If `useAdminGetAllCompetitions()` fails, `AdminCompetitionsPage` shows a visible English error state (not just an infinite spinner) and provides a Retry action.",
        "If `useIsCallerAdmin()` fails inside `AdminGuard`, show a visible English error state explaining that admin status could not be verified and provide a Retry button, rather than only showing a loader forever.",
        "Admin Results and Admin Users pages show a clear English error state when their list queries fail, and allow retry (React Query refetch)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (single-actor architecture).",
    "Only add `backend/migration.mo` if state migration is required by changes (conditional migration policy).",
    "Do not edit any files under `frontend/src/components/ui` (immutable component sources).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not change the public (non-admin) competition/solve/leaderboard flows beyond what is necessary to fix admin-side errors.",
    "Do not introduce any new authentication provider (Internet Identity remains the only auth mechanism).",
    "Do not add external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}