{
  "kind": "build_request",
  "title": "Fix inspection penalty timing to stop at solve start (do not include solve time)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-116",
      "text": "Fix the inspection-time penalty calculation so that inspection timing stops exactly when the solve timer starts (not when the solve ends), ensuring WCA inspection penalties are applied based only on the duration from inspection start to solve start.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Please try again. Also, ensure the instructions are accurate, which means the calculation of time inspection stops and timer starts . no other changes"
        ]
      },
      "acceptanceCriteria": [
        "When a user starts inspection (InspectionTimer onStart), the app records an inspectionStart timestamp.",
        "When the user starts the solve timer (SolveTimer start action), the app records a solveStart timestamp and uses (solveStart - inspectionStart) as the inspection duration for penalty logic.",
        "The inspection duration used for penalty logic MUST NOT include the time spent solving (i.e., it must not reference the time at solve completion).",
        "If inspection duration is >= 15,000ms and < 17,000ms, apply +2 seconds to the attempt (same penalty semantics currently used).",
        "If inspection duration is >= 17,000ms, mark the attempt as DNF (same DNF marker semantics currently used).",
        "The existing user-facing messages/toasts for +2 and DNF remain in English and are triggered based on the corrected timing.",
        "No other behavior changes to solve flow, session handling, scramble fetching, result submission, or navigation beyond what is necessary to correct the inspection timing measurement."
      ]
    }
  ],
  "constraints": [
    "Make no functional changes other than correcting when inspection timing stops and when solve timing starts for penalty calculation.",
    "Do not edit files under frontend immutablePaths.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Changing backend Ao5 / penalty logic or any backend validation behavior.",
    "Changing the inspection countdown UI/behavior (other than wiring accurate timestamps).",
    "Fixing unrelated issues such as competition start/resume UX, admin flows, payment flows, or leaderboard behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}