{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "SolveFlow refresh recovery: sync from server session state and notify auto-DNF advance",
  "requirements": [
    {
      "id": "REQ-118",
      "summary": "On SolveFlowPage load, sync attempt/phase from server session state (using the existing session token) and notify the user if refresh auto-marked the prior attempt as DNF and advanced.",
      "acceptanceCriteria": [
        "On SolveFlowPage mount, the page uses the existing session token (from sessionStorage) to fetch server session state and sets `currentAttempt`/phase based on the server response, not only on local component state.",
        "If the backend indicates the previous attempt was auto-marked DNF due to refresh, the UI shows a clear English notification (toast and/or inline) such as: \"This attempt was marked DNF because the page was refreshed. Continuing with attempt <n>.\"",
        "After refresh, the scramble shown and the attempt counter reflect the advanced attempt index (i.e., user proceeds to the next scramble/attempt).",
        "All user-facing errors/messages shown for this flow remain English-only and any surfaced errors continue to go through `normalizeError` where applicable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a solve-session state query hook (e.g., `useGetSolveSessionState`) that uses the stored session token to request the current server session state for (competitionId,event), returning attempt index, attempts list, completion status, and any backend-provided \"auto DNF due to refresh\" indicator so SolveFlowPage can render based on server truth."
        },
        {
          "path": "frontend/src/types/backend-extended.ts",
          "operation": "modify",
          "description": "Extend `SessionStateResponse` typing to include any additional optional fields required for the new refresh handling UI (e.g., a boolean/metadata flag indicating an auto-DNF-on-refresh occurred and what attempt index the user is continuing with), while keeping backward compatibility if the backend does not provide the flag."
        },
        {
          "path": "frontend/src/pages/SolveFlowPage.tsx",
          "operation": "modify",
          "description": "On mount (after retrieving the session token from sessionStorage), fetch server session state via the new hook and set `currentAttempt`, `attempts`, and `phase` from the server response (including showing the advanced attempt index after refresh). If the response indicates the previous attempt was auto-marked DNF due to refresh, show an English-only notification (toast and/or inline `Alert`) and ensure scramble fetching uses the updated `currentAttempt`. Ensure any displayed errors are passed through `normalizeError`."
        },
        {
          "path": "frontend/src/api/errors.ts",
          "operation": "modify",
          "description": "If needed for clearer SolveFlow recovery UX, add/adjust English-only normalization for any new/changed backend error messages surfaced by the session-state retrieval so SolveFlowPage continues to show user-friendly messages via `normalizeError`."
        }
      ]
    }
  ]
}