{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix paid competition Pay button no-op + improve loading/disabled states and diagnostics",
  "requirements": [
    {
      "id": "REQ-34",
      "summary": "Ensure Pay click in CompetitionDetailPage never silently no-ops by replacing early-return guard with explicit English UI feedback for missing prerequisites and surfacing all unexpected errors via normalizeError.",
      "acceptanceCriteria": [
        "When a paid competition is running and the Pay button is visible, clicking it never results in a no-op (no checkout + no spinner + no error).",
        "If `userProfile` is not yet loaded, show a disabled button state and a visible message such as \"Loading your profile…\" OR show a toast explaining the user must wait.",
        "If `userProfile` is missing (not created), show a clear English message (page-level or toast) telling the user to complete profile setup first; do not silently return.",
        "If competition data is missing/unavailable, show a clear English error and do not attempt to load Razorpay or create an order.",
        "All unexpected errors in the pay/start flow are surfaced using `normalizeError(error)` (toast and/or page alert), not swallowed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CompetitionDetailPage.tsx",
          "operation": "modify",
          "description": "Replace the current early-return guard in the paid payment-start flow with explicit prerequisite checks that always produce a visible outcome (disable + inline message, page-level alert, and/or toast) for: competition missing, entry fee missing, user profile still loading, and user profile missing (not created). Ensure any thrown/unknown errors are routed through normalizeError(error) and displayed (toast and/or alert), never swallowed."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Improve Pay button disabled/loading logic to reflect Razorpay configuration loading/availability states.",
      "acceptanceCriteria": [
        "While `configLoading === true`, the Pay button is disabled and shows a clear English loading state indicating payments are being checked.",
        "If `isRazorpayConfigured === false`, the page shows a persistent English error message (using the existing `paymentError` alert) and the Pay button remains disabled.",
        "When `isRazorpayConfigured === true` and prerequisites are met, clicking Pay proceeds to show \"Processing...\" and continues the payment flow (load script → create order → open checkout → confirm → start)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CompetitionDetailPage.tsx",
          "operation": "modify",
          "description": "Update Pay button state computation and label rendering so that while useIsRazorpayConfigured() is loading (configLoading), the Pay button is disabled and displays an inline English label such as \"Checking payments…\". If isRazorpayConfigured is false, set/keep the existing paymentError alert visible and keep the Pay button disabled without attempting Razorpay script load/order creation."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Add minimal, non-secret console diagnostics for each boundary in the payment click path (script load, order creation, checkout open, confirmation).",
      "acceptanceCriteria": [
        "Developer console shows a clear breadcrumb trail when Pay is clicked (e.g., \"pay_click\", \"razorpay_script_loaded\", \"order_created\", \"checkout_opened\", \"payment_confirmed\").",
        "No secrets (Razorpay key secret, signatures beyond what is already returned by Razorpay checkout, etc.) are printed to the console.",
        "On any thrown error, a `console.error` is present and the UI shows a user-facing English error (toast and/or alert)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CompetitionDetailPage.tsx",
          "operation": "modify",
          "description": "Add console.log breadcrumbs at the start of the click handler and around each payment step boundary (script load result, order created, checkout opened/resolved, confirmation succeeded, start succeeded). Add console.error on failures with safe context (competitionId/event and high-level status only). Ensure no secrets are logged (do not print signatures/keys; avoid dumping full payment objects) and keep all user-facing text in English."
        }
      ]
    }
  ]
}