{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stop inspection penalty timing at solve start (exclude solve time)",
  "requirements": [
    {
      "id": "REQ-116",
      "summary": "Measure inspection duration from inspection start to solve start (not solve end) and apply WCA +2/DNF penalties based on that duration only.",
      "acceptanceCriteria": [
        "When a user starts inspection (InspectionTimer onStart), the app records an inspectionStart timestamp.",
        "When the user starts the solve timer (SolveTimer start action), the app records a solveStart timestamp and uses (solveStart - inspectionStart) as the inspection duration for penalty logic.",
        "The inspection duration used for penalty logic MUST NOT include the time spent solving (i.e., it must not reference the time at solve completion).",
        "If inspection duration is >= 15,000ms and < 17,000ms, apply +2 seconds to the attempt (same penalty semantics currently used).",
        "If inspection duration is >= 17,000ms, mark the attempt as DNF (same DNF marker semantics currently used).",
        "The existing user-facing messages/toasts for +2 and DNF remain in English and are triggered based on the corrected timing.",
        "No other behavior changes to solve flow, session handling, scramble fetching, result submission, or navigation beyond what is necessary to correct the inspection timing measurement."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/solve/SolveTimer.tsx",
          "operation": "modify",
          "description": "Add an optional onStart callback prop (or equivalent) that is invoked exactly when the solve timer starts, passing/recording the solve start timestamp so the parent can stop inspection timing at this moment. Ensure existing solve timer start/stop behavior and UI remain unchanged besides emitting this start signal."
        },
        {
          "path": "frontend/src/pages/SolveFlowPage.tsx",
          "operation": "modify",
          "description": "Update inspection penalty calculation to use (solveStartTime - inspectionStartTime) captured at the moment the solve starts (from SolveTimer start action), and store the resulting inspection penalty/DNF marker to apply on solve completion without referencing completion time. Keep existing +2/DNF toast messages in English and trigger them based on the corrected inspection duration. Ensure no other solve flow behaviors change (session handling, scrambles, submission, navigation)."
        }
      ]
    }
  ]
}