{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Admin UI stubs by wiring React Query admin hooks to backend actor and adding reliable Admin error states",
  "requirements": [
    {
      "id": "REQ-129",
      "summary": "Remove admin-related placeholder hooks in useQueries and connect Admin UI flows to real backend actor methods (competitions, users, results visibility).",
      "acceptanceCriteria": [
        "`useAdminCreateCompetition()` no longer throws \"Backend method not available: adminCreateCompetition\" and successfully creates a competition when the caller is an admin; on success it invalidates the relevant queries (`QUERY_KEYS.competitions`, `QUERY_KEYS.adminCompetitions`).",
        "`useAdminUpdateCompetition()` no longer throws \"Backend method not available: adminUpdateCompetition\" and successfully saves edits from the Admin Edit page.",
        "`useAdminDeleteCompetition()`, `useAdminLockCompetition()`, and `useAdminActivateCompetition()` call real backend methods and the Admin competitions list actions succeed without toast errors caused by missing hooks.",
        "`useAdminGetUsers()`, `useAdminBlockUser()`, `useAdminDeleteUser()` (used by `frontend/src/pages/admin/AdminUsersPage.tsx`) load real users and execute actions end-to-end.",
        "`useAdminGetCompetitionResults()` and `useAdminToggleResultVisibility()` (used by `frontend/src/pages/admin/AdminResultsPage.tsx`) load real results and can both hide and unhide, with the UI reflecting `result.isHidden` reliably.",
        "All surfaced UI errors remain English-only and are routed through `normalizeError` where applicable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Replace admin stub query/mutation implementations that throw \"Backend method not available\" with real actor calls for: competition create/update/delete, lock/unlock, activate/deactivate; admin users list/block/unblock/delete; admin results list (with reliable `isHidden`) and visibility toggle. Ensure React Query invalidation matches existing keys (e.g., QUERY_KEYS.competitions, QUERY_KEYS.adminCompetitions, QUERY_KEYS.adminUsers, QUERY_KEYS.adminResults/adminCompetitionResults)."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the frontend backend actor type definitions to include any admin methods that the existing Admin UI and updated hooks will call (e.g., admin competition update/delete where needed, admin user delete, admin results list/toggle visibility), so the frontend compiles against the real backend capabilities."
        },
        {
          "path": "frontend/src/pages/admin/AdminCompetitionsPage.tsx",
          "operation": "modify",
          "description": "Align page behavior with updated admin hooks (create/update/delete/lock/activate) and ensure all mutation error handling continues to use `normalizeError` for English-only error messages."
        },
        {
          "path": "frontend/src/pages/admin/AdminUsersPage.tsx",
          "operation": "modify",
          "description": "Wire user list and actions to the updated real admin hooks; replace any remaining console-only error handling for mutations with normalized, user-visible error handling consistent with other Admin pages."
        },
        {
          "path": "frontend/src/pages/admin/AdminResultsPage.tsx",
          "operation": "modify",
          "description": "Wire results listing and visibility toggle to the updated real admin hooks so `result.isHidden` is sourced reliably and the toggle action updates the UI via React Query invalidation/refetch (using `normalizeError` for user-visible errors)."
        }
      ]
    },
    {
      "id": "REQ-130",
      "summary": "Add stable, actionable Admin error states with Retry actions so Admin pages don’t hang on failed queries/mutations.",
      "acceptanceCriteria": [
        "If `useAdminGetAllCompetitions()` fails, `AdminCompetitionsPage` shows a visible English error state (not just an infinite spinner) and provides a Retry action.",
        "If `useIsCallerAdmin()` fails inside `AdminGuard`, show a visible English error state explaining that admin status could not be verified and provide a Retry button, rather than only showing a loader forever.",
        "Admin Results and Admin Users pages show a clear English error state when their list queries fail, and allow retry (React Query refetch)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/system/AdminQueryErrorPanel.tsx",
          "operation": "create",
          "description": "Create a reusable Admin-focused inline error panel component that displays normalized English error text and a Retry button that triggers a provided `onRetry` (React Query refetch). Use existing UI primitives (do not modify files under `frontend/src/components/ui`)."
        },
        {
          "path": "frontend/src/components/auth/AdminGuard.tsx",
          "operation": "modify",
          "description": "Update AdminGuard to handle `useIsCallerAdmin()` query failures by rendering a visible error state (using `normalizeError`) with a Retry action that refetches admin status, instead of showing an indefinite loader."
        },
        {
          "path": "frontend/src/pages/admin/AdminCompetitionsPage.tsx",
          "operation": "modify",
          "description": "Add a clear inline error state for failures of `useAdminGetAllCompetitions()` and a Retry button that triggers React Query refetch (use the new AdminQueryErrorPanel and `normalizeError`)."
        },
        {
          "path": "frontend/src/pages/admin/AdminUsersPage.tsx",
          "operation": "modify",
          "description": "Extend the existing error UI to include a Retry action that refetches the users list query when `useAdminGetUsers()` fails (use AdminQueryErrorPanel and `normalizeError`)."
        },
        {
          "path": "frontend/src/pages/admin/AdminResultsPage.tsx",
          "operation": "modify",
          "description": "Add a Retry action for results list query failures (`useAdminGetCompetitionResults()`), ensuring the page shows a stable English error state instead of appearing to hang (use AdminQueryErrorPanel and `normalizeError`)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure admin queries used by AdminGuard/Admin pages expose stable error state to the UI (avoid configurations that can cause indefinite loading on error) and keep all surfaced UI errors English-only and routed through `normalizeError` at call sites."
        }
      ]
    }
  ]
}