{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Results: true hide/unhide toggle backed by persisted hidden flag",
  "requirements": [
    {
      "id": "REQ-72",
      "summary": "Update Admin Results Management to use a backend-provided per-result hidden flag and provide a true hide/unhide toggle with correct per-row UI state and English-only strings.",
      "acceptanceCriteria": [
        "In /admin/results, each result row shows a visibility action that clearly supports both states: when a result is visible, the action hides it; when a result is hidden, the action unhides it.",
        "After hiding a result, reloading /admin/results (or re-selecting competition+event) still shows that row as hidden (state is persisted server-side), and the action available is to unhide.",
        "After unhiding a result, reloading /admin/results still shows that row as visible, and the action available is to hide.",
        "The backend results listing used by the admin UI includes an explicit boolean field indicating whether the result is currently hidden for (competitionId, event, user). The frontend uses this field (not `(result as any).isHidden`).",
        "All user-facing strings introduced/changed for this fix remain English-only (e.g., tooltip and toast text for hide/unhide)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Align generated frontend backend typings with the backend results listing used by /admin/results by adding an explicit boolean hidden flag to the admin results row type (e.g., extend CompetitionResult with `isHidden: boolean` or introduce a dedicated admin result type). This enables the UI to read persisted hidden state without casting to `any`."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the admin results query hook typing for `useAdminGetResultsForCompetition` to return the results type that includes the explicit `isHidden` boolean from the backend results listing, and ensure cache invalidation/refetch behavior remains correct after toggling visibility (keep changes minimal and scoped to admin results)."
        },
        {
          "path": "frontend/src/pages/admin/AdminResultsPage.tsx",
          "operation": "modify",
          "description": "Replace the current hidden-state guess `(result as any).isHidden` with the explicit backend-provided `result.isHidden` flag, and ensure the per-row action properly toggles both directions (hide when visible, unhide when hidden) with accurate icon/title/English-only toast text reflecting the current state. Keep all other UI/UX unchanged and do not modify any files under frontend/src/components/ui."
        }
      ]
    }
  ]
}