{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 11,
  "summary": "Full-stack online speedcubing competition platform (Next.js + TS + PostgreSQL/Prisma + NextAuth on Vercel) with WCA-style 5-solve flow, per-user unique \"mcubes\" user ID and profile, immediate leaderboard updates on completion, multi-event competitions, optional paid entry via Razorpay (test keys for now), and admin-only competition creation restricted via an allowlist (currently email-based) that needs to include thiirdparty.mcubes@gmail.com and/or MCUBES-0.",
  "architectural_notes": [
    "Tech stack: Next.js (App Router) + TypeScript + PostgreSQL + Prisma ORM + NextAuth; deploy on Vercel.",
    "Competition format mirrors WCA-style online comps: 5 scrambles/solves with inspection and penalties.",
    "Result integrity enforced server-side: no client-side trust for attempt counts; validate session/ownership and prevent duplicate submissions.",
    "Database constraint: unique (competitionId, userId) for Results to prevent joining twice.",
    "Add a persistent, app-specific \"mcubes user ID\" for each user profile (separate from auth provider identifiers).",
    "Introduce paid competitions via Razorpay integration (test credentials first), with a competition entry fee and payment-gated participation where applicable.",
    "Extend data model to support multiple events per competition (event catalog includes 2x2, 3x3, 4x4, 5x5, Skewb, Megaminx, Clock, 3x3 OH, Pyraminx).",
    "Admin authorization allowlist email should be midhun.speedcuber@gmail.com (used for competition creation and admin UI guards).",
    "Admin authorization should support expanding the allowlist beyond a single email, potentially including multiple emails and/or specific mcubes user IDs (e.g., MCUBES-0).",
    "Extend User/Profile model to include optional country and gender fields; ensure leaderboard joins results with user profile for display name (fallback to \"Anonymous\" only if missing)."
  ],
  "known_issues": [
    "Creating a competition currently fails with a generic \"unable to create\" error when the logged-in user's stored email does not match the allowlisted admin email; needs clearer messaging and/or updated allowlist value.",
    "Leaderboard currently shows \"Anonymous\" instead of the user's profile/display name; needs to render the correct name from the user profile."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-implement-user-authentication-using-internet-identity-ii-and-require-login-to-participate-in-competitions-store-a-user-profile-record-keyed-by-principal-with-a-user-editable-display-name-and-ensure-only-authenticated-users-can-create-results-or-submit-solves",
      "title": "Implement user authentication using Internet Identity (II) and require login to participate in competitions. Store a user profile record keyed by Principal with a user-editable display name, and ensure only authenticated users can create results or submit solves.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-an-admin-only-competition-management-flow-admins-can-create-competitions-with-name-slug-start-end-dates-status-upcoming-running-completed-optional-participant-limit-and-exactly-5-scrambles-non-admin-users-can-only-read-competition-info",
      "title": "Implement an admin-only competition management flow: admins can create competitions with name, slug, start/end dates, status (upcoming/running/completed), optional participant limit, and exactly 5 scrambles. Non-admin users can only read competition info.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-the-competition-participation-lifecycle-users-can-view-a-competition-intro-page-and-click-start-competition-once-starting-creates-the-user-s-result-record-if-not-already-started-and-users-cannot-join-twice-restart-or-reset-their-progress",
      "title": "Implement the competition participation lifecycle: users can view a competition intro page and click “Start Competition” once. Starting creates the user’s Result record (if not already started), and users cannot join twice, restart, or reset their progress.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-build-the-solve-flow-ui-for-5-solves-per-competition-show-one-scramble-at-a-time-hide-the-scramble-until-inspection-starts-run-a-15-second-wca-inspection-timer-with-penalties-2-for-15-17s-dnf-for-17s-run-a-client-side-solve-timer-and-submit-each-attempt-to-the-backend-prevent-navigating-back-to-previous-scrambles-and-automatically-advance-to-the-next-scramble-until-completion",
      "title": "Build the solve flow UI for 5 solves per competition: show one scramble at a time, hide the scramble until inspection starts, run a 15-second WCA inspection timer with penalties (+2 for 15–17s, DNF for >17s), run a client-side solve timer, and submit each attempt to the backend. Prevent navigating back to previous scrambles and automatically advance to the next scramble until completion.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-leaderboard-page-per-competition-that-lists-completed-results-only-computes-average-of-5-drop-best-and-worst-sorts-ascending-best-first-displays-rankings-and-paginates-when-result-count-is-large",
      "title": "Add a leaderboard page per competition that lists completed results only, computes Average of 5 (drop best and worst), sorts ascending (best first), displays rankings, and paginates when result count is large.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-ui-ux-safeguards-during-an-in-progress-solve-session-use-a-dark-minimal-interface-focused-on-the-timer-with-large-typography-clearly-visible-scramble-once-revealed-warn-users-before-page-refresh-close-and-prevent-accidental-back-navigation-during-the-solve-flow-as-much-as-the-browser-allows",
      "title": "Implement UI/UX safeguards during an in-progress solve session: use a dark, minimal interface focused on the timer with large typography, clearly visible scramble once revealed, warn users before page refresh/close, and prevent accidental back navigation during the solve flow as much as the browser allows.",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    },
    {
      "id": "feature-create-a-coherent-visual-theme-for-the-app-and-apply-it-consistently-across-all-pages-typography-spacing-component-styling-and-states-while-keeping-the-ui-dark-and-minimal-avoid-blue-purple-as-primary-colors",
      "title": "Create a coherent visual theme for the app and apply it consistently across all pages (typography, spacing, component styling, and states) while keeping the UI dark and minimal. Avoid blue/purple as primary colors.",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    },
    {
      "id": "feature-design-the-backend-api-surface-motoko-actor-methods-and-frontend-data-layer-react-query-to-support-future-expandability-for-multiple-events-e-g-3x3-2x2-and-future-paid-competitions-webhook-processing-without-implementing-payments-now",
      "title": "Design the backend API surface (Motoko actor methods) and frontend data layer (React Query) to support future expandability for multiple events (e.g., 3x3, 2x2) and future paid competitions/webhook processing, without implementing payments now.",
      "reqIds": [
        "REQ-10"
      ],
      "version": 1
    },
    {
      "id": "feature-restrict-admin-privileges-and-thus-competition-creation-access-to-the-single-allowlisted-account-email-miidhun-speedcuber-gmail-com-and-update-all-admin-checks-and-ui-guards-to-use-this-allowlist-rule",
      "title": "Restrict admin privileges (and thus competition creation access) to the single allowlisted account email \"miidhun.speedcuber@gmail.com\", and update all admin checks and UI guards to use this allowlist rule.",
      "reqIds": [
        "REQ-11"
      ],
      "version": 1
    },
    {
      "id": "feature-extend-competitions-to-support-multiple-events-selectable-at-creation-time-supporting-at-minimum-2x2-3x3-4x4-5x5-skewb-megaminx-clock-3x3-one-handed-pyraminx-store-event-specific-scrambles-exactly-5-scrambles-per-event-and-update-the-solve-flow-and-leaderboard-to-be-per-event-within-a-competition",
      "title": "Extend competitions to support multiple events selectable at creation time, supporting at minimum: 2x2, 3x3, 4x4, 5x5, Skewb, Megaminx, Clock, 3x3 One-Handed, Pyraminx; store event-specific scrambles (exactly 5 scrambles per event) and update the solve flow and leaderboard to be per-event within a competition.",
      "reqIds": [
        "REQ-13"
      ],
      "version": 1
    },
    {
      "id": "feature-add-support-for-free-vs-paid-competitions-at-creation-time-including-an-entry-amount-when-paid-enforce-that-users-must-complete-payment-razorpay-test-mode-before-they-can-start-a-paid-competition-event",
      "title": "Add support for free vs paid competitions at creation time, including an entry amount when paid; enforce that users must complete payment (Razorpay test mode) before they can start a paid competition event.",
      "reqIds": [
        "REQ-14"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-that-when-a-user-finishes-all-5-solves-for-a-competition-event-their-result-is-marked-completed-server-side-and-appears-in-the-leaderboard-immediately-after-completion-without-requiring-a-manual-page-refresh",
      "title": "Ensure that when a user finishes all 5 solves for a competition event, their result is marked completed server-side and appears in the leaderboard immediately after completion without requiring a manual page refresh.",
      "reqIds": [
        "REQ-15"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-frontend-admin-gating-messaging-to-reflect-that-there-can-be-multiple-allowlisted-administrators-not-just-a-single-admin-and-ensure-the-adminguard-continues-to-block-access-to-the-admin-competition-creation-page-when-the-backend-reports-the-caller-is-not-an-admin",
      "title": "Update the frontend admin gating messaging to reflect that there can be multiple allowlisted administrators (not just a single admin), and ensure the AdminGuard continues to block access to the admin competition creation page when the backend reports the caller is not an admin.",
      "reqIds": [
        "REQ-18"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-user-facing-profile-section-in-the-ui-where-an-authenticated-user-can-view-and-edit-their-displayname-country-and-gender-and-persist-changes-to-the-backend",
      "title": "Add a user-facing Profile section in the UI where an authenticated user can view and edit their `displayName`, `country`, and `gender`, and persist changes to the backend.",
      "reqIds": [
        "REQ-21"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-leaderboard-ui-data-loading-and-display-logic-so-that-each-row-shows-the-competitor-s-profile-display-name-when-available-and-only-falls-back-to-anonymous-when-no-display-name-exists",
      "title": "Update the leaderboard UI data-loading and display logic so that each row shows the competitor’s profile display name when available, and only falls back to \"Anonymous\" when no display name exists.",
      "reqIds": [
        "REQ-22"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Implement authentication with NextAuth (email/password + OAuth), enforce unique email accounts, and store user profile (display name).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Competition system: admin can create competitions (name/slug/dates/status, 5 scrambles, optional participant limit); users can view intro and start once; per-user state (not started/in progress/completed) with join-once enforcement.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Solve flow: 5 solves per competition with hidden scramble until inspection; 15s inspection with +2 (15–17s) and DNF (>17s); browser timer; save each solve server-side; prevent backtracking; lock after completion.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Define PostgreSQL/Prisma database schema for Users, Competitions, Scrambles, Results with constraints (unique competitionId+userId) and penalty storage.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Security rules: session validation on API/routes; users can only update own results; server validates attempt number/solve count; prevent double submissions and manual POST manipulation.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Leaderboard: show completed results; compute Ao5 (drop best & worst); sort ascending; display rankings with pagination.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "UI/UX: dark minimal theme focused on timer (large font), clear scramble display, disable back navigation during solve, warn on refresh.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Deployment readiness for Vercel: Prisma migrations; use server actions or API routes appropriately; provide folder structure, key routes, seed script, and solve page logic.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Future expandability: support multiple events (3x3/2x2/etc), enable paid competitions later, and add payment gateway webhook support.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-11",
      "summary": "Add backend data models and persistence in the single Motoko actor for: Users, Competitions, Scrambles (5 per competition), and Results (one per user per competition). Enforce uniqueness of one Result per (competitionId, userPrincipal) and store per-attempt times plus penalties and status (not started / in progress / completed).",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-15",
      "summary": "Implement server-side security and integrity rules for solve submissions: validate the caller session, ensure users can only mutate their own result, validate attempt number and competition status, and prevent double submissions/manual POST manipulation by making submissions idempotent and rejecting invalid state transitions.",
      "reqIds": [
        "REQ-6"
      ],
      "status": "pending"
    },
    {
      "id": "AR-16",
      "summary": "Restrict admin privileges/competition creation to a specific allowlisted account: miidhun.speedcuber@gmail.com (only this user can create competitions).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-17",
      "summary": "On account creation, generate and persist a unique \"mcubes user ID\" per user (in addition to auth identity) and maintain a user profile used to store/display results.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-18",
      "summary": "Competitions can be created as free or paid with an entry amount; integrate Razorpay checkout/payment capture using test key/id initially (support swapping to production keys later).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-19",
      "summary": "Support competitions with multiple events (e.g., 2x2, 3x3, 4x4, 5x5, Skewb, Megaminx, Clock, 3x3 One-Handed, Pyraminx) selectable during competition creation.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-20",
      "summary": "Ensure leaderboard updates immediately when a user completes a competition (results appear right away without manual refresh where feasible).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-22",
      "summary": "On first-time profile creation, generate and persist a unique \"mcubes user ID\" for each user and store it in the user profile alongside display name; ensure it is stable across sessions and can be fetched with getCallerUserProfile.",
      "reqIds": [
        "REQ-12"
      ],
      "status": "pending"
    },
    {
      "id": "AR-23",
      "summary": "Define and generate a custom \"mcubes user ID\" format based on join year/date + first 3 letters of first name + first letter of last name + a sequence suffix (01/02/...) to disambiguate users with the same name pattern.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-24",
      "summary": "Update the backend allowlisted admin email used to authorize competition creation from \"miidhun.speedcuber@gmail.com\" to \"midhun.speedcuber@gmail.com\", so that the user with stored email \"midhun.speedcuber@gmail.com\" can successfully create competitions.",
      "reqIds": [
        "REQ-16"
      ],
      "status": "pending"
    },
    {
      "id": "AR-25",
      "summary": "Expand admin authorization allowlist to also grant admin rights to thiirdparty.mcubes@gmail.com and/or to a specific mcubes user ID (MCUBES-0) for competition creation/admin UI access.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-26",
      "summary": "Update admin authorization so that competition-creation/admin access is granted to either (a) users whose stored email is allowlisted, including \"midhun.speedcuber@gmail.com\" and \"thiirdparty.mcubes@gmail.com\", OR (b) users whose stored mcubes user ID is exactly \"MCUBES-0\".",
      "reqIds": [
        "REQ-17"
      ],
      "status": "pending"
    },
    {
      "id": "AR-27",
      "summary": "Add/edit user profile section to capture additional fields (country, gender) and update leaderboard to display the user's profile name instead of \"Anonymous\" (fall back to Anonymous only when no name is set).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-28",
      "summary": "Extend the backend user profile model to store additional optional fields for `country` and `gender`, and ensure existing profiles continue to work after the schema change.",
      "reqIds": [
        "REQ-19"
      ],
      "status": "pending"
    },
    {
      "id": "AR-29",
      "summary": "Fix leaderboard name resolution by providing a backend query API that allows reading public profile info (at minimum `displayName`, plus `country`/`gender` if available) for any competitor principal, so the leaderboard does not show \"Anonymous\" when a user has a display name set.",
      "reqIds": [
        "REQ-20"
      ],
      "status": "pending"
    }
  ],
  "projectName": "WCA-style online speedcubing competition platform (Internet Computer: Motoko + React)",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}