{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-12T15:31:51.805Z",
  "summary": "Diff adds `registrationStartDate` to backend competition DTOs and introduces a migration that sets it to null for existing stored competitions. Frontend wiring exists for reading/typing `registrationStartDate`, and CompetitionDetailPage includes client-side gating logic. However, backend enforcement (blocking start/payment before registrationStartDate) and backend auto-transition from upcoming->running are not evidenced in the provided diff summary. There are also unrelated frontend changes (e.g., AdminUsersPage) not requested.",
  "missing_requirements": [
    {
      "id": "REQ-103",
      "requirement": "Backend must reject participation/session-start and paid-entry initiation when competition is upcoming, registrationStartDate is set, and now < registrationStartDate; gating must not apply when registrationStartDate is unset.",
      "reason": "The diff summary shows new types and migration, but no evidence of updated backend methods that start sessions or create Razorpay orders performing the required time/status checks and returning a clear error.",
      "evidence": [
        "backend/main.mo (truncated; shows DTO changes but not method logic)"
      ]
    },
    {
      "id": "REQ-104",
      "requirement": "Backend must automatically transition competitions from #upcoming to #running when now >= registrationStartDate, without scheduled jobs (e.g., on reads or participation calls), and without relaxing existing startDate/endDate enforcement.",
      "reason": "No evidence in the diff summary of any code path that updates stored competition status based on registrationStartDate during normal usage.",
      "evidence": [
        "backend/main.mo (truncated; no auto-transition logic shown)"
      ]
    },
    {
      "id": "REQ-105",
      "requirement": "Admin create/edit pages must include a datetime-local Registration Start Date field, display existing value on edit, and include it in the CompetitionInput sent to create/update hooks (with English-only messages and normalizeError usage).",
      "reason": "State for registrationStartDate is present and edit page populates it, but the diff excerpts are truncated before showing the actual form field (`<input type=\"datetime-local\">`) and the final CompetitionInput assignment/submit payload including registrationStartDate.",
      "evidence": [
        "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx (truncated at `registrationStartDate: regi`)",
        "frontend/src/pages/admin/AdminEditCompetitionPage.tsx (truncated before submit payload / field rendering)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Changes to AdminUsersPage (user history/reset dialog/actions) unrelated to registrationStartDate gating or auto-transition.",
      "reason": "BuildRequest explicitly limits scope to registrationStartDate gating + auto transition; AdminUsersPage is not mentioned in any requirement.",
      "evidence": [
        "frontend/src/pages/admin/AdminUsersPage.tsx"
      ]
    },
    {
      "description": "Added/expanded date formatting utilities (formatDateTime) not explicitly requested (beyond using existing app date formatting).",
      "reason": "REQ-106 asks to format the date consistently with existing formatting; adding a new formatter may be extra scope (though it may be used to meet the UI message).",
      "evidence": [
        "frontend/src/lib/dateUtils.ts"
      ]
    }
  ],
  "confidence": 0.64,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/lib/dateUtils.ts",
    "frontend/src/pages/CompetitionDetailPage.tsx",
    "frontend/src/pages/admin/AdminCreateCompetitionPage.tsx",
    "frontend/src/pages/admin/AdminEditCompetitionPage.tsx",
    "frontend/src/pages/admin/AdminUsersPage.tsx",
    "frontend/src/types/backend-extended.ts",
    "project_state.json"
  ]
}